[
  {
    "numero_en": "1.1",
    "numero_fr": "1.1",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Has the digital service been given a favourable assessment in terms of its usefulness, measured against its environmental impact?",
    "critere_fr": "Le service numérique a-t-il été évalué favorablement en termes d'utilité en tenant compte de ses impacts environnementaux ?",
    "objectif_en": "Avoid unnecessary digital services: if the digital service is not in line with at least one of the Sustainable Development Goals (SDGs), one of the Planetary boundaries issues, or any other such framework, then all of the environmental impacts it generates are futile and should be avoided.",
    "objectif_fr": "Éviter le service numérique inutile : si le service numérique ne s'inscrit pas dans au moins l'un des objectifs de développement durable (ODD), l'un des enjeux de limites planétaires ou tout autre référentiel du même type, l'intégralité des impacts environnementaux qu'il génère est futile, donc à éviter.",
    "miseEnOeuvre_en": "To evaluate the usefulness of the service, refer to reference systems and determine upstream of the project whether it is genuinely useful, for example:\n- the [17 UN SDGs](https://en.wikipedia.org/wiki/Sustainable_Development_Goals)\n- the [9 Planetary boundaries](https://en.wikipedia.org/wiki/Planetary_boundaries)\n\nIf the utility of the service is not in line with these frames of reference, justify how the service is useful, and how it contributes to the general interest or supports a public policy.\n\nDisplay the SDGs with which the service is in line in the ecodesign declaration (refer to the dedicated criteria) or in the legal wording.\nCheck, for example, one or more of these points: its relevance, its usefulness, the extent to which it creates value, its soundness, how it serves the general interest, how it meets essential needs, how it helps foster the emergence of a digital commons, etc.",
    "miseEnOeuvre_fr": "Pour évaluer l'utilité du service, se référer à des référentiels et déterminer en amont du projet si son utilité est avéré, comme par exemple :\n- les [17 ODD de l'ONU](https://fr.wikipedia.org/wiki/Objectifs_de_d%C3%A9veloppement_durable)\n- les [9 limites planétaires](https://fr.wikipedia.org/wiki/Limites_plan%C3%A9taires)\n- autre ?\n\nSi l'utilité du service ne s'inscrit pas dans ces référentiels, justifier en quoi le service est utile, participe à l'intérêt général ou est en appui à une politique publique.\n\nAfficher dans la déclaration d'écoconception (se référer aux critères dédiés) ou dans les mentions légales, les ODD dans lequel le service s'inscrit.\nVérifier par exemple un ou plusieurs de ces points : sa pertinence, son utilité, sa création de valeur, son bien fondé, son service pour l'intéret général, sa réponse à des besoins essentiels, sa participation à la mise en place de commun numérique, etc.",
    "controle_en": "How was the service assessed, e.g. what sustainability goals does the service meet, what solutions for keeping within global limits or other reference frameworks used (specify which one), and their relevance in the ecodesign declaration for this digital service.",
    "controle_fr": "Comment a été évalué le service, par exemple dans quels objectifs de développement durables s'inscrit le service, quelles sont les réponses aux enjeux de limites planétaires ou autre référentiel utilisé (précisé lequel), et leur pertinence dans la déclaration d'écoconception de ce service numérique."
  },
  {
    "numero_en": "1.2",
    "numero_fr": "1.2",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Has the digital service defined its target users?",
    "critere_fr": "Le service numérique a-t-il défini ses cibles utilisatrices ?",
    "objectif_en": "In order to meet the needs of the users of the digital service, it is essential to know these targets, how they intend to use it, their needs and their behaviour. This is so as to avoid overloading the digital applications with features and content, while at the same time not stripping them down to the point that they fail to meet expectations. Neither too much, nor too little.\nWithout identifying primary and secondary user categories, it is difficult to size the digital service correctly.",
    "objectif_fr": "Pour répondre au plus juste aux utilisatrices et utilisateurs du service numérique, il est indispensable de connaître ses cibles, leurs usages, leurs besoins et leurs comportements, afin de ne pas surcharger les applicatifs numériques en fonctionnalités et contenus, ni les appauvrir au point qu'ils ne répondent pas aux attentes. Ni TROP, ni TROP PEU.\nSans l'identification des catégories d'utilisateurs primaires et secondaires, il est difficile de dimensionner correctement le service numérique.",
    "miseEnOeuvre_en": "Tools and components of the UX research phase: competitive study, analysis of the existing situation, definition of personas, interviews or surveys with users, observation, etc.",
    "miseEnOeuvre_fr": "Outils et composants de la phase de Recherche UX (UX research) : étude concurrentielle, analyse de l'existant, définition des personas, réalisation d'entretiens ou de sondages avec les utilisateurs, observation, etc.",
    "controle_en": "Have access to these research phase reference documents: user interviews, UX study, benchmark, personas, marketing study, etc., so that target users can be precisely defined.",
    "controle_fr": "Avoir accès à ces documents de référence de la phase de recherche : entretiens utilisateurs, étude UX, benchmark, personas, étude marketing, etc. permettant de définir précisément les utilisateurs cibles."
  },
  {
    "numero_en": "1.3",
    "numero_fr": "1.3",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Has the digital service defined the business needs and real expectations of the target users?",
    "critere_fr": "Le service numérique a-t-il défini les besoins métiers et les attentes réelles des utilisateurs cibles ?",
    "objectif_en": "Uncertainties lead to having to extrapolate needs, often beyond real expectations.\nAlso, one cannot meet the \"right needs\" because there is no clear idea of who the users are, or one is only meeting the client's needs. All this ends up being a bad investment of resources, time spent and environmental impacts generated.\nIt is important to avoid any non-essential features and functions.\nOn the other hand, it is important to check whether or not one or more existing services already meet the need, so as not to duplicate them.",
    "objectif_fr": "Les incertitudes poussent à extrapoler les besoins souvent au-delà des attentes réelles.\nOn peut également ne pas répondre aux \"bons besoins\" parce que l'on connaît mal ses utilisateurs ou l'on répond juste à ce que demande le commanditaire. Tout cela finit par être un mauvais investissement de ressources, de temps passé et des impacts environnementaux générés.\nIl faut éviter toute fonctionnalité non essentielle.\nD'autre part, il est important de vérifier qu'un ou plusieurs services existants répondent déjà au besoin, pour ne pas les dupliquer.",
    "miseEnOeuvre_en": "* Interviews with the various stakeholders and the business functions concerned,\n* UX research focusing on target users,\n* Define primary and secondary users,\n* Allied practice: agile approaches.\n* Observation of usage statistics in the event of an already existing service",
    "miseEnOeuvre_fr": "* Entretiens avec les différentes parties prenantes et les métiers concernés,\n* Recherche UX auprès des utilisateurs cibles,\n* Définir les utilisateurs primaires et secondaires,\n* Pratique alliée : les approches agiles.\n* Observation des statistiques d'usages dans le cas d'un service déja existant",
    "controle_en": "Have access to a reference document: interviews, research, observations, surveys or other documents so that the way in which the business need is expressed or the real expectations of target users can be precisely defined.",
    "controle_fr": "Avoir accès à un document de référence : entretiens, recherches, observations, sondages ou autres permettant précisément de définir l'expression de besoin métier ou les attentes réelles des utilisateurs cibles."
  },
  {
    "numero_en": "1.4",
    "numero_fr": "1.4",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Has the digital service determined the list of hardware profiles that users will be able to use to access it?",
    "critere_fr": "Le service numérique a-t-il défini la liste des profils de matériels que les utilisateurs vont pouvoir employer pour y accéder ?",
    "objectif_en": "A digital service that uses only the latest technical resources may incentivise users to renew their devices in order to be able to access it (hardware obsolescence).\nThis means that some uses may be constrained by users' devices. In order to enable a wider selection of devices to be used, even older ones, and to limit the need to replace devices, it is important to know the hardware profiles that users will be able to use, today and tomorrow: screen size, touch screen or not, smartphone, tablet, laptop, desktop, etc.",
    "objectif_fr": "Un service numérique n'exploitant que des ressources techniques de toute dernière génération peut conduire les utilisateurs à renouveler leurs équipements afin d'y accéder (obsolescence matérielle).\nAinsi, certaines utilisations peuvent être contraintes par les terminaux des utilisateurs. Pour permettre un choix plus large d'équipements même anciens et limiter les renouvellements de matériels, il est important de connaître les profils de matériel que les utilisateurs vont pouvoir employer, aujourd'hui et demain : taille d'écran, écran tactile ou non, smartphone, tablette, ordinateur portable, ordinateur de bureau, etc.",
    "miseEnOeuvre_en": "Define the profile of supported hardware as old as possible to avoid hardware obsolescence.",
    "miseEnOeuvre_fr": "Définir le profil des matériels supportés, le plus ancien possible afin d'éviter toute obscolescence matérielle.",
    "controle_en": "Profiles of supported devices included in the ecodesign declaration to be displayed on the site (see dedicated criterion 1.12).",
    "controle_fr": "Profil des matériels supportés indiqués dans la déclaration d'écoconception à afficher sur le site (voir critère dédié 1.12)."
  },
  {
    "numero_en": "1.5",
    "numero_fr": "1.5",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Can the digital service be used on devices that are 5 years old or older?",
    "critere_fr": "Le service numérique est-il utilisable sur des terminaux âgés de 5 ans ou plus ?",
    "objectif_en": "The energy savings that result from using new devices do not offset the impacts of their manufacture. The digital service must help to prevent older devices from becoming obsolescent by running on the oldest possible devices.",
    "objectif_fr": "Les gains d'énergie des nouveaux matériels ne permettent pas de contrebalancer les impacts liés à leur fabrication. Le service numérique doit limiter sa contribution à leur obsolescence en fonctionnant sur des équipements les plus anciens possibles.",
    "miseEnOeuvre_en": "Ensure for each feature that the digital service is compatible with older devices. For example, this criterion can be added in the tests or QA (Quality assurance).\n Details of the criterion:\n- This is to do with compatibility with a device and not with an operating system or any other software used to run the digital service (e.g. a browser). It is therefore not a question here of making the digital service compatible with software or with operating systems whose security updates have not been implemented.\n- Definition of \"Usable\" here: degraded mode accepted but without loss of essential functionality or content for the service.\n-This is 5 years rolling, i.e. the moment the audit is carried out needs to be taken into consideration and not the date that the service goes online.\n- A longer compatibility period is recommended. In such cases, specify the target, for example in the ecodesign declaration.\n- This criterion does not exclude the use of recent features and functions designed to reduce environmental impact during use as long as the service remains available on older versions (principle of progressive improvement).",
    "miseEnOeuvre_fr": "S'assurer pour chaque fonctionnalité, que le service numérique est compatible avec des équipements anciens. Par exemple, ce critère peut être ajouté dans les tests ou QA (Quality assurance).\nPrécisions concernant le critère :\n- Il s'agit de la compatibilité avec un matériel et non avec un système d'exploitation ou tout autre logiciel faisant fonctionner le service numérique (par exemple un navigateur). Il ne s'agit donc pas ici de rendre compatible le service numérique avec des logiciels ou des systèmes d'exploitation dont les mises à jour de sécurité n'ont pas été faites.\n- Définition de \"Utilisable\" ici : mode dégradé accepté mais sans perte de fonctionnalité incontournable ni de contenu pour le service.\n- Il s'agit de 5 ans \"glissants\" c'est à dire qu'il faut tenir compte du moment où l'audit est réalisé et non de la date de mise en ligne du service.\n- Une durée de compatibilité plus longue est recommandée. Préciser dans ce cas, l'objectif, par exemple dans la déclaration d'écoconception.\n- Ce critère n'exclut pas l'usage de fonctionnalités récentes permettant la réduction des impacts environnementaux à l'usage tant que le service reste disponible sur les anciennes versions (principe d'amélioration progressive).",
    "controle_en": "Test critical digital service functionality on legacy devices.",
    "controle_fr": "Tester les fonctionnalités critiques du service numérique sur un équipement ancien."
  },
  {
    "numero_en": "1.6",
    "numero_fr": "1.6",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Does the digital service adapt to devices with different types of displays?",
    "critere_fr": "Le service numérique s'adapte-t-il à différents types de terminaux d'affichage ?",
    "objectif_en": "The digital service should help to keep the numbers of new devices which need to be purchased by running on devices with a variety of screen sizes, including the smallest (e.g. old smartphones), to a minimum.",
    "objectif_fr": "Le service numérique doit participer à limiter l'achat de nouveaux terminaux en fonctionnant sur des équipements aux dimensions d'écrans variées, dont les plus petites (smartphones anciens par exemple).",
    "miseEnOeuvre_en": "Only if applicable, ensure that the digital service's interface adapts to the size of the screen without usability being compromised (\"Responsive design\"). Furthermore, it is best to avoid duplicating the digital service with specific versions for each type of device.",
    "miseEnOeuvre_fr": "Uniquement si applicable, rendre l'interface du service numérique adaptable à la taille de l'écran sans perte d'utilisabilité (\"Responsive design\"). De plus, il vaut mieux éviter de dupliquer le service numérique avec une version spécifique pour chaque terminal.",
    "controle_en": "Test the digital service's features and functions on different display sizes (desktop, tablet and mobile).",
    "controle_fr": "Tester les fonctionnalités critiques du service numérique sur différentes tailles d'affichage (ordinateur de bureau, tablette et mobile)."
  },
  {
    "numero_en": "1.7",
    "numero_fr": "1.7",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Has the digital service been designed using standard interoperable technologies rather than specific and closed technologies?",
    "critere_fr": "Le service numérique a-t-il été conçu avec des technologies standard interopérables plutôt que des technologies spécifiques et fermées ?",
    "objectif_en": "The aim is to combat software-induced device obsolescence. For example, native applications need the latest OS (operating system) versions or even the latest hardware versions to work, leading to hardware obsolescence. Few native applications work on devices longer than 7 years. Whereas digital web services, for example, can be used with any browser and on any device. This ensures good interoperability and longevity.",
    "objectif_fr": "L'objectif est de lutter contre l'obsolescence des équipements induite par le logiciel. Par exemple, les applications natives ont besoin des dernières versions d'OS (système d'exploitation) ou même les dernières versions des équipements pour fonctionner ce qui induit une obsolescence des matériels. Peu d'applications natives fonctionnent sur des équipements au-delà de 7 ans. Alors que des services numériques web par exemple sont a priori disponibles dans tout navigateur et pour tout type d'équipement. Ce qui leur assure une bonne interopérabilité et une bonne longévité.",
    "miseEnOeuvre_en": "Well upstream of the development process, assess the feasibility of using standard technologies (e.g. web rather than proprietary applications) to meet user and business needs.\nIt is also important to ensure that the APIs used are standard and well supported (JavaScript APIs in web browsers for example).\nUsing interoperable technologies helps combat software obsolescence. Similarly, developing a service using open-source components means that you can maintain control over code maintenance. This maximises the longevity of the code and reduces the risk of obsolescence created by the software on the hardware.",
    "miseEnOeuvre_fr": "Bien en amont du développement, évaluer la faisabilité avec des technologies standard (par exemple, web plutôt que des applications propriétaires) pour répondre au besoin des utilisateurs et des métiers.\nIl s'agit aussi de s'assurer que les API utilisées sont standard et sont bien supportées (API javascript dans les navigateurs web par exemple).\nS'appuyer sur des technologies interopérables permet de lutter contre l'obsolescence logicielle. De même, construire son service à partir de composants open source permet de garder la main sur la maintenance du code utilisé, par conséquent améliorer la durabilité du code et de réduire le risque d'obsolescence induite par le logiciel sur le matériel.",
    "controle_en": "If this is the case, assess the need to have made the decision to develop a proprietary application: technical constraint, control over the target device?",
    "controle_fr": "Si c'est le cas, évaluer la nécessité d'avoir choisi de développer une application propriétaire : contrainte technique, matériel cible maitrisé ?"
  },
  {
    "numero_en": "1.8",
    "numero_fr": "1.8",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Does the digital service have at least one identified digital eco-design referent?",
    "critere_fr": "Le service numérique a-t-il au moins un référent identifié en écoconception numérique ?",
    "objectif_en": "Digital ecodesign is aimed at a very broad scope, which is difficult to grasp fully in each one of the project phases. It is essential that the professionals involved in the project be able to rely on one or more coordinators at all times to assist them in ensuring that best practice is used.",
    "objectif_fr": "L'écoconception numérique adresse un très large périmètre, qu'il est difficile d'appréhender complètement dans chaque phase projet. Il est indispensable que les professionnels intervenant sur le projet puissent s'appuyer à tout moment sur une ou des personnes référentes afin de les assister dans les meilleures pratiques à déployer.",
    "miseEnOeuvre_en": "The referent(s), whether internal or external, ensure that the project teams are familiar with the concept of ecodesign in digital services in order to encourage its inclusion in the projects.",
    "miseEnOeuvre_fr": "Le ou les référents, internes ou externes, s'assurent de l'acculturation des équipes projet à l'écoconception de service numérique afin d'encourager sa prise en compte dans les projets.",
    "controle_en": "Names of referents and certifications or qualifications obtained.",
    "controle_fr": "Noms des référents et certifications ou qualifications obtenues."
  },
  {
    "numero_en": "1.9",
    "numero_fr": "1.9",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Has the digital service identified indicators for measuring its environmental impacts?",
    "critere_fr": "Le service numérique a-t-il identifié des indicateurs pour mesurer ses impacts environnementaux ?",
    "objectif_en": "Know the environmental impacts of the digital service. Have an overview of the impacts that the digital service has at each phase (beginning, during use, end) and by integrating the environmental impacts of the hardware devices used, in the production and in the use of this digital service.",
    "objectif_fr": "Connaître les impacts environnementaux du service numérique. Avoir une vision globale des conséquences du service numérique, à chaque phase (début, usage, fin) et en intégrant les impacts environnementaux des équipements matériels utilisés, dans la production et dans l'usage de ce service numérique.",
    "miseEnOeuvre_en": "Conduct a diagnosis based on an LCA methodology, a multi-criteria life cycle analysis (screening, simplified or ISO). The environmental impact indicators to be considered are (as a minimum) primary energy consumption, GHG emissions, blue water consumption and depletion of abiotic resources.\nThe scope of the life cycle analysis can be extended, for example, by taking into account the means of production: environmental impacts of the design equipment, the online services mobilised (testing and QA environment, etc.), travel for the teams, etc.",
    "miseEnOeuvre_fr": "Faire un diagnostic basé sur une méthodologie ACV, une analyse de cycle de vie (screening, simplifiée ou ISO) multicritère. Les indicateurs d'impacts environnementaux à considérer à minima la consommation d'énergie primaire, les émissions GES, la consommation d'eau bleue et l'épuisement des ressources abiotiques.\nLe périmètre de l'analyse de cycle de vie peut être élargi par exemple en tenant compte des moyens de productions : impacts environnementaux des équipements de conception, les services en ligne mobilisés (environnement de test, de QA...), les déplacements des équipes, etc.",
    "controle_en": "A reference document (Life Cycle Assessment - LCA - for example) of the actions to be undertaken or already undertaken, ranked by project phase.\n* What indicators have been defined?\n* How are these indicators monitored?\n* Are they published / in the public domain and if so, where?\n* What measuring arrangements have been made?",
    "controle_fr": "Un document de référence (Analyse de cycle de vie - ACV - par exemple) des actions à entreprendre ou déjà entreprises, classées par phase projet.\n* Quels sont les indicateurs définis ?\n* Comment sont suivis ces indicateurs ?\n* Sont-ils publiés / ouverts et si oui, où ?\n* Quel est le rythme de mesure ?"
  },
  {
    "numero_en": "1.10",
    "numero_fr": "1.10",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Has the digital service set targets for reducing or limiting its own environmental impacts?",
    "critere_fr": "Le service numérique s'est-il fixé des objectifs en matière de réduction ou de limitation de ses propres impacts environnementaux ?",
    "objectif_en": "Minimise the environmental footprint of the digital service.",
    "objectif_fr": "Minimiser l'empreinte environnementale du service numérique.",
    "miseEnOeuvre_en": "Set targets for the digital service's environmental footprint in relation to the expected number of users. The indicators to be monitored are (as a minimum) primary energy consumption, GHG emissions, blue water consumption and depletion of abiotic resources.\nDepending on the context, it should be specified whether the indicators are absolute (kg CO2e) or relative (kg CO2e/user).",
    "miseEnOeuvre_fr": "Fixer les objectifs en matière d'empreinte environnementale du service numérique au regard du nombre d'utilisateurs escomptés. Les indicateurs suivies doivent à a minima être la consommation d'énergie primaire, les émissions GES, la consommation d'eau bleue et l'épuisement des ressources abiotiques.\nSelon le contexte, il convient de préciser s'il s'agit d'indicateurs en valeur absolue (kg CO2e) ou relative (kg CO2e/utilisateur).",
    "controle_en": "What targets have been set?",
    "controle_fr": "Quels sont les objectifs fixés ?"
  },
  {
    "numero_en": "1.11",
    "numero_fr": "1.11",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Does the digital service conduct regular reviews to ensure that it is reducing or limiting its environmental impacts ?",
    "critere_fr": "Le service numérique réalise-t-il régulièrement des revues pour s'assurer du respect de la réduction ou de la limitation de ses impacts environnementaux ?",
    "objectif_en": "Depending on the context, a digital service may evolve: the team might change, users might add content, processing operations might become more resource-hungry, etc. \nTo ensure that the ecodesign approach lasts over time, it is important to conduct reviews on a regular basis.",
    "objectif_fr": "Selon le contexte, un service numérique peut évoluer : équipe qui change, ajout de contenu par les utilisateurs, traitements de plus en plus gourmands, ...\nPour veiller à ce que la démarche d'écoconception dure dans le temps, il est important de réaliser régulièrement une revue.",
    "miseEnOeuvre_en": "Regular review, audit or self-audit, monthly or yearly depending on the context and size of the project, applying this reference framework.\nIn addition, conduct performance audits and load tests on the application/component/microservice, identifying any bottlenecks, all resources used, etc.",
    "miseEnOeuvre_fr": "Revue, audit ou auto-audit régulier, tous les mois ou tous les ans selon le contexte et la taille du projet, en appliquant ce référentiel.\nDe plus, réaliser des audits de performances et tests de charge au sein de l'application/composant/microservice avec identification des bottlenecks, des ressources utilisées, …",
    "controle_en": "Results of the review, results of the performance and load audits, results of the audit based on this reference framework, etc.",
    "controle_fr": "Résultat de la revue, résultat des audits de performance et de charges, résultat de l'audit en se basant sur ce référentiel, ..."
  },
  {
    "numero_en": "1.12",
    "numero_fr": "1.12",
    "thematique_en": "Strategy",
    "thematique_fr": "Stratégie",
    "critere_en": "Has the digital service published an ecodesign declaration or policy?",
    "critere_fr": "Le service numérique publie-t-il une déclaration ou une politique d'écoconception ?",
    "objectif_en": "Communicate the strategy in place for reducing the environmental impact of the digital service, including reducing the way it contributes to rendering devices obsolescent.",
    "objectif_fr": "Communiquer la stratégie mise en place afin de réduire les impacts environnementaux du service numérique, notamment la réduction de la contribution à l'obsolescence induite sur les terminaux.",
    "miseEnOeuvre_en": "This voluntary declaration, to be displayed for example in the legal notice, alongside the declaration of accessibility or on a dedicated page, will contain the following, for example:\n* Sustainable Development Goals (SDGs), responses to the challenges posed by global limitations or any other reference framework (to be specified) within which this digital service lies.\n*Software versions of the supported user device (browser, operating system, etc.). Example: \n'iOS 11 minimum, Android 2015 minimum... \"\n* Type, year of manufacture or target versions of user devices supported (type of smartphone, screen size, etc.). Example: \"iPhone 5 / Samsung Galaxy S3 minimum\" or \"Any mobile device manufactured after 2014\".\n* Minimum connection for accessing the service. Example: \"2G on a mobile device / 512 Kbs with a broadband connection\".\n* Adaptation to different screen sizes: yes / no. If yes, specify the minimum screen size.\n* Strategy implemented and targets in terms of reducing or limiting environmental impacts: indicate the actions implemented to reduce resource consumption, e.g. maximum number of server requests, size taken up by resources per screen or for a given user path.\n* Date of publication or update of this declaration.",
    "miseEnOeuvre_fr": "Cette déclaration d'une démarche volontaire, à afficher par exemple dans les mentions légales, aux côtés de la déclaration d'accessibilité ou bien sur une page dédiée, contiendra par exemple :\n* Objectifs de Développement Durable (ODD), réponses aux enjeux des limites planétaires ou tout autre référentiel (à préciser) dans lequel s'inscrit ce service numérique.\n* Versions logicielles du terminal utilisateur supporté (navigateur, système d'exploitation, etc.). Exemple : \"iOS 11 minimum, Android année 2015 minimum...\"\n* Type, année de construction ou versions cibles des équipements utilisateurs supportés (type de smartphone, taille écran, etc.). Exemple : \"iPhone 5 / Samsung Galaxy S3 minimum\" ou bien \"Tout équipement mobile datant de 2014 minimum\".\n* Connexion minimum pour accéder au service. Exemple : \"2G en mobile / 512 Kbs en connexion fixe\".\n* Adaptation à différentes tailles d'écran : oui / non. Si oui, indiquer la taille minimum de l'écran.\n* Stratégie mise en œuvre et objectifs en matière de réduction ou de limitation des impacts environnementaux : indiquer les actions mises en œuvre pour réduire la consommation de ressources, par exemple le nombre de requêtes serveurs maximum, le poids des ressources par écran ou pour un parcours utilisateur donné.\n* Date de publication ou de mise à jour de cette déclaration.",
    "controle_en": "Detailed presence of an ecodesign declaration or policy",
    "controle_fr": "Présence détaillée d'une déclaration ou d'une politique d'écoconception"
  },
  {
    "numero_en": "2.1",
    "numero_fr": "2.1",
    "thematique_en": "Specifications",
    "thematique_fr": "Spécifications",
    "critere_en": "Has the digital service been designed with a design review and a code review so as to reduce the environmental impacts of each feature?",
    "critere_fr": "Le service numérique a-t-il été conçu avec une revue de conception et une revue de code en ayant pour un des objectifs de réduire les impacts environnementaux de chaque fonctionnalité ?",
    "objectif_en": "In order to arrive at the most efficient solution possible while at the same time meeting the need, the whole team's collective intelligence is required. And for this, it is not enough to simply validate the design by undertaking a code review ' a practice that is now quite widespread. You need to think about the design and architectural choices upstream of the development process, with minimising environmental impacts as one of the objectives. This is also positive for the team and for the project more widely.",
    "objectif_fr": "Afin d'aboutir à une solution la plus sobre possible tout en répondant au besoin, il faut miser sur l'intelligence collective de toute l'équipe. Et pour cela, il ne suffit pas seulement de valider la conception par la revue de code, une bonne pratique maintenant assez répandue. Il est nécessaire, et cela sera positif pour l'équipe et pour le projet, de réfléchir en amont du développement, aux choix de conception et d'architecture, en ayant pour un des objectifs la minimisation des impacts environnementaux.",
    "miseEnOeuvre_en": "By involving the entire team and all the business functions, a design review is conducted upstream of development process to choose a solution that meets the requirement, while at the same time minimising the environmental impact. Then, if code has been written to implement the solution, a code review is undertaken after the development.",
    "miseEnOeuvre_fr": "En impliquant l'ensemble de l'équipe, l'ensemble des métiers, une revue conception en amont du développement est réalisée pour choisir la solution répondant au besoin tout en minimisant les impacts environnementaux. Puis, si du code a été produit pour implémenter la solution, une revue de code est faite en aval du développement.",
    "controle_en": "What development process is in place?",
    "controle_fr": "Quel est le processus de développement mis en place ?"
  },
  {
    "numero_en": "2.2",
    "numero_fr": "2.2",
    "thematique_en": "Specifications",
    "thematique_fr": "Spécifications",
    "critere_en": "Does the digital service have a decommissioning strategy for its unused features, components or environments?",
    "critere_fr": "Le service numérique a-t-il prévu une stratégie de décommissionnement pour ses fonctionnalités, ses composants ou ses environnements non utilisés ?",
    "objectif_en": "The aim is to decommission technical environments that are still active but no longer in use: Production, QA (Quality assurance), Test, development environment, etc. These environments take up IT resources unnecessarily.",
    "objectif_fr": "L'objectif est de décommisionner les environnements techniques encore actifs mais qui ne sont plus utilisés : Production, QA (Quality assurance), Test, environnement de développement, etc. Ces environnements occupent de la ressource informatique inutilement.",
    "miseEnOeuvre_en": "Define a strategy for decommissioning environments and set withdrawal dates.",
    "miseEnOeuvre_fr": "Définir une stratégie de décomissionnement des environnements et des dates de rappel.",
    "controle_en": "List the active environments and their state of use.",
    "controle_fr": "Lister les environnements actifs et leur état d'utilisation."
  },
  {
    "numero_en": "2.3",
    "numero_fr": "2.3",
    "thematique_en": "Specifications",
    "thematique_fr": "Spécifications",
    "critere_en": "Does the digital service require its suppliers to ensure that they reduce their environmental impact?",
    "critere_fr": "Le service numérique impose-t-il à ses fournisseurs de garantir une démarche de réduction de leurs impacts environnementaux ?",
    "objectif_en": "A project is rarely implemented entirely within the scope covered by organisation. Many external resources are mobilised during the project and must be aligned with the approach.",
    "objectif_fr": "Un projet est rarement réalisé avec un périmètre couvert totalement au sein de l'organisation. De nombreuses ressources externes sont mobilisées au cours du projet et se doivent d'être alignées avec la démarche.",
    "miseEnOeuvre_en": "Identify the necessary resources and associate them with environmental requirements. The scope of the approach covers the design of the digital service (not the supplier itself). Refer to the [Practical Guide to Sustainable Digital Procurement](https://ecoresponsable.numerique.gouv.fr/publications/guide-pratique-achats-numeriques-responsables/) (in french).",
    "miseEnOeuvre_fr": "Identifier les ressources nécessaires et leur associer des exigences environnementales. Le périmètre de la démarche porte sur la conception du service numérique (non sur le fournisseur lui-même). Se référer au [Guide pratique pour des achats numériques responsables](https://ecoresponsable.numerique.gouv.fr/publications/guide-pratique-achats-numeriques-responsables/).",
    "controle_en": "What specifications incorporating environmental clauses have been imposed on suppliers for the design of the digital service?",
    "controle_fr": "Quelles sont les spécifications intégrant des clauses environnementales qui ont été imposées aux fournisseurs pour la conception du service numérique ?"
  },
  {
    "numero_en": "2.4",
    "numero_fr": "2.4",
    "thematique_en": "Specifications",
    "thematique_fr": "Spécifications",
    "critere_en": "Has the digital service taken the environmental impacts of the off-the-shelf interface components used into consideration?",
    "critere_fr": "Le service numérique a-t-il pris en compte les impacts environnementaux des composants d'interface prêts à l'emploi utilisés ?",
    "objectif_en": "Know the environmental impacts of interface components (buttons, forms, etc.), design systems that are overlays to the operating system interfaces, used as part of the digital service.",
    "objectif_fr": "Connaitre les impacts environnementaux des composants d'interface (bouton, formulaires...), des systèmes de design qui sont des surcouches aux interfaces du système d'exploitation, utilisés dans le service numérique.",
    "miseEnOeuvre_en": "For example, gauge the size of these interface components so as to make informed choices.",
    "miseEnOeuvre_fr": "Mesurer par exemple le poids de ces composants d'interface pour mieux faire un choix.",
    "controle_en": "Are these interface components designed to reduce their environmental impacts?\nAre there any comparative measures available with similar components?",
    "controle_fr": "Ces composants d'interface sont-ils conçus afin de réduire leurs impacts environnementaux ?\nDes mesures comparatives entre composants similaires existent-elles ?"
  },
  {
    "numero_en": "2.5",
    "numero_fr": "2.5",
    "thematique_en": "Specifications",
    "thematique_fr": "Spécifications",
    "critere_en": "Has the digital service taken the environmental impacts of the third-party services used into consideration when selecting them?",
    "critere_fr": "Le service numérique a-t-il pris en compte les impacts environnementaux des services tiers utilisés lors de leur sélection ?",
    "objectif_en": "Reduce the environmental impacts of third-party services, namely ones that were not developed internally.",
    "objectif_fr": "Réduire les impacts environnementaux des services tiers, donc non issus de développement interne.",
    "miseEnOeuvre_en": "Third-party services are services offered by external suppliers (developers, organisations or companies) providing ready-to-use features and functions (e.g. audience tracking, video player, social network news feed, captcha mechanism, etc.), eliminating the need to redevelop them internally.\nAn A/B test analytics tool measurement provides information about the environmental impacts in order to help with decision-making regarding the environmental factor.",
    "miseEnOeuvre_fr": "Les services de tiers sont des services proposés par des fournisseurs externes (développeurs, organismes ou entreprises) apportant des fonctionnalités prêtes à l'emploi (par exemple suivi d'audience, lecteur vidéo, fil d'actualités des réseaux sociaux, mécanisme de captcha...) et évitant ainsi de les re-développer en interne.\nUne mesure d'outils analytics A/B test permet de connaitre les impacts environnementaux de celui-ci afin d'aider à la prise de décision sur le facteur environnemental.",
    "controle_en": "Measurements provided by the third-party service. \n Supporting evidence or comparisons justifying the choice made.",
    "controle_fr": "Mesures fournies par le service tiers.\nJustificatifs ou comparatifs validant le choix effectué."
  },
  {
    "numero_en": "3.1",
    "numero_fr": "3.1",
    "thematique_en": "Architecture",
    "thematique_fr": "Architecture",
    "critere_en": "Is the digital service underpinned by architecture, resources or components designed to reduce their own environmental impacts?",
    "critere_fr": "Le service numérique repose-t-il sur une architecture, des ressources ou des composants conçus pour réduire leurs propres impacts environnementaux ?",
    "objectif_en": "The digital service may depend on components that are not developed by the same team or that are provided by production frameworks. It is then necessary to ensure that these dependencies are also designed to reduce their own environmental impacts.",
    "objectif_fr": "Le service numérique peut dépendre de composants qui ne sont pas développés par la même équipe ou qui sont fournis par des frameworks de production. Il s'agit alors de s'assurer que ces dépendances soient également conçues de manière à réduire leurs propres impacts environnementaux.",
    "miseEnOeuvre_en": "Assess the design of existing components. Are they themselves governed by this reference framework?\nSee also criteria 2.4 and 2.5 for factoring in the impacts of interface components and third-party services.",
    "miseEnOeuvre_fr": "Évaluer la façon dont ont été conçus les composants existants. Sont-ils eux-mêmes soumis à ce référentiel ?\nVoir aussi les critères 2.4 et 2.5 pour la prise en compte des impacts des composants d'interface et des services tiers.",
    "controle_en": "Implementation checks",
    "controle_fr": "Vérification de la mise en œuvre"
  },
  {
    "numero_en": "3.2",
    "numero_fr": "3.2",
    "thematique_en": "Architecture",
    "thematique_fr": "Architecture",
    "critere_en": "Does the digital service operate based on an architecture that can adapt the quantity of resources used based on how the service is used?",
    "critere_fr": "Le service numérique fonctionne-t-il sur une architecture pouvant adapter la quantité de ressources utilisées en fonction de la consommation du service ?",
    "objectif_en": "The aim is to avoid over-sized architecture and to give preference to architecture that can be scaled up.",
    "objectif_fr": "L'objectif est d'éviter une architecture surdimensionnée et de privilégier une architecture capable de passer à l'échelle.",
    "miseEnOeuvre_en": "Finely assess the need and the number of users in order to adapt the necessary IT resources.",
    "miseEnOeuvre_fr": "Évaluer finement le besoin, le nombre d'utilisateurs pour adapter les ressources informatiques nécessaires.",
    "controle_en": "For example, to obtain a comparison between the resources allocated and those consumed over a period of time.",
    "controle_fr": "Obtenir par exemple un comparatif entre les ressources allouées et celles consommées sur une période de temps."
  },
  {
    "numero_en": "3.3",
    "numero_fr": "3.3",
    "thematique_en": "Architecture",
    "thematique_fr": "Architecture",
    "critere_en": "Has the digital service taken the technical evolution of protocols into account?",
    "critere_fr": "Le service numérique a-t-il pris en compte l'évolution technique des protocoles ?",
    "objectif_en": "Prevent the service from becoming obsolescent as a result of the obsolescence of the protocol used, for example: \n*in the face of a shortage of IPv4 addresses and the increasingly widespread use of IPv6 addresses (in the medium term, some Internet service providers will no longer offer IPv4) by guaranteeing its interoperability and durability,\n* browsers are tending to block the HTTP protocol and require the use of HTTPS.",
    "objectif_fr": "Limiter l’obsolescence du service induite par l'obsolescence du protocole utilisé, par exemple :\n* face à la pénurie d'IPv4 et la généralisation d'IPv6 (à moyen terme, certains accès internet ne proposeront plus de connectivité IPv4) en garantissant son interopérabilité et sa pérennité,\n* les navigateurs tendent vers le blocage du protocole HTTP et l'obligation d'utiliser HTTPS.",
    "miseEnOeuvre_en": "For example:\n* Define an IPv6 test policy that includes testing from a device on which IPv4 connectivity has been disabled. Objective: to detect code or functions that work only in IPv4, which will be unusable in the medium term, once IPv4 has been completely phased out,\n* In a context in which the user accesses the digital service via their browser, it is mandatory to use HTTPS instead of HTTP.",
    "miseEnOeuvre_fr": "Par exemple :\n* Définir une stratégie de test IPv6 qui inclut des tests depuis un équipement où la connectivité IPv4 est désactivée. Objectif : déceler du code ou des fonctions qui ne fonctionnent qu'en IPv4 only, qui seront inutilisables à moyen terme, avec le retrait d'IPv4,\n* Dans un contexte où l'utilisateur accède au service numérique par son navigateur, il est obligatoire d'utiliser HTTPS au lieu de HTTP.",
    "controle_en": "Check that the various components that make up the digital service are working properly:\n* in IPv6 and not using any IPv4-only service,\n* and that they use HTTPS and not HTTP.\n\nIt will probably be complex to check these cases via an external audit. Ask the team if any of the components use 'hard' IPs or http URLs.",
    "controle_fr": "Vérifier que les différents composants du service numérique fonctionnent bien :\n* en IPv6 et ne font appel à aucun service IPv4 only,\n* en HTTPS et non en HTTP.\n\nIl sera sans doute complexe de vérifier ces cas depuis un audit externe. Demander à l'équipe si certains composants utilisent des IP ou des urls en http \"en dur\"."
  },
  {
    "numero_en": "3.4",
    "numero_fr": "3.4",
    "thematique_en": "Architecture",
    "thematique_fr": "Architecture",
    "critere_en": "Does the digital service use a suitable exchange protocol for the content transferred?",
    "critere_fr": "Le service numérique utilise-t-il un protocole d'échange adapté aux contenus transférés ?",
    "objectif_en": "Limit or reduce data transfer by choosing a protocol adapted to the data to be exchanged, operating as efficiently as possible to cater to current and future uses.",
    "objectif_fr": "Limiter ou réduire le transfert de données en choisissant un protocole adapté aux données à échanger, en répondant le plus sobrement possible aux usages actuels et à venir.",
    "miseEnOeuvre_en": "You need to make sure that the protocol you have chosen is appropriate for the type of content being shared, and you need to analyse existing protocols in terms of content and functionality, taking into account their environmental footprint.\nThere are many protocols, each with their own specific advantages and disadvantages. For example,\n* for video streaming: HTTP Live Streaming (HLS), Real-Time Messaging Protocol (RTMP), Web Real-Time Communications (WebRTC)...\n* for APIs: REST, SOAP, GraphQL, Protocol Buffers...",
    "miseEnOeuvre_fr": "Il s'agit de s'assurer de l'adéquation entre le choix du protocole et le type des contenus échangés, d'analyser les protocoles existants en fonction des contenus et des fonctionnalités en tenant compte de leur empreinte environnementale.\nIl existe de nombreux protocoles, chacun ayant ses avantages et ses inconvénients. Par exemple,\n* pour le streaming vidéo : HTTP Live Streaming (HLS), Real-Time Messaging Protocol (RTMP), Web Real-Time Communications (WebRTC)...\n* pour les API : REST, SOAP, GraphQL, Protocol Buffers...",
    "controle_en": "Assess the suitability of the protocol used in relation to the content transferred.",
    "controle_fr": "Évaluer l'adéquation du protocole utilisé par rapport au contenu transféré."
  },
  {
    "numero_en": "3.5",
    "numero_fr": "3.5",
    "thematique_en": "Architecture",
    "thematique_fr": "Architecture",
    "critere_en": "Does the digital service provide patches throughout the expected lifetime of the devices and software that make up the service?",
    "critere_fr": "Le service numérique garantit-il la mise à disposition de mises à jour correctives pendant toute la durée de vie prévue des équipements et des logiciels liés au service ?",
    "objectif_en": "Help prevent the equipment used for the service from becoming obsolete.",
    "objectif_fr": "Limiter la contribution à l'obsolescence des équipements liés au service.",
    "miseEnOeuvre_en": "Maintain the digital service throughout the planned life of the device.\nThis includes specific devices and connected objects (IoT).",
    "miseEnOeuvre_fr": "Maintenir le service numérique pendant toute la durée prévue de l'équipement.\nSont visés ici des équipements spécifiques et les objets connectés (IOT).",
    "controle_en": "Check that the support timeframe is given and that updates are indeed available.",
    "controle_fr": "Vérifier que la durée de maintenance est indiquée et que les mises à jours sont effectivement disponibles."
  },
  {
    "numero_en": "3.6",
    "numero_fr": "3.6",
    "thematique_en": "Architecture",
    "thematique_fr": "Architecture",
    "critere_en": "Does the digital service include the installation of corrective updates independently of evolutionary updates?",
    "critere_fr": "Le service numérique propose-t-il d'installer des mises à jour correctives indépendamment des mises à jour évolutives ?",
    "objectif_en": "Help prevent users' devices from becoming obsolete.\nPromote long-term support policies (\"Long term support\").",
    "objectif_fr": "Limiter la contribution à l'obsolescence des équipements utilisateurs.\nPromouvoir les politiques de support à long terme (\"Long term support\").",
    "miseEnOeuvre_en": "This criterion is applicable above all for a digital service such as an API / component / library / framework / open source tool, and more rarely applies for a product intended for end users.\nFor example, is there a version management strategy with 'Long-term support' versions in place and is there a changelog that correctly details the changes included in each update?",
    "miseEnOeuvre_fr": "Ce critère est applicable surtout pour un service numérique de type api / composants / bibliothèque / framework / outils open source et beaucoup plus rarement un produit destiné à des utilisateurs finaux.\nPar exemple, une stratégie de gestion de versions avec des versions \"Long term support\" est mise en place et un changelog (journal des modifications) indique-t-il correctement les changements effectués par les mises à jour ?",
    "controle_en": "Implementation checks",
    "controle_fr": "Vérification de la mise en œuvre"
  },
  {
    "numero_en": "4.1",
    "numero_fr": "4.1",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Can the digital service be used via a low-speed connection?",
    "critere_fr": "Le service numérique est-il utilisable via une connexion bas débit ?",
    "objectif_en": "If the digital service is aimed at a wide audience, then you will not have control over connection speeds. Care should be taken not to exclude certain audiences who do not have high-speed Internet access.\nIn addition to bridging the digital divide, this is also good practice for the environment. This is because users do not always know what slows down a digital service: the network connection, the digital service or the device used?\nA lighter digital service therefore needs far fewer network resources to operate.",
    "objectif_fr": "Si le service numérique s'adresse à un large public, vous ne maitrisez donc pas le niveau de connectivité. Il est nécessaire de veiller à ne pas exclure certains publics qui n'ont pas accès à de hauts débits.\nTout en permettant de réduire la fracture numérique, il s'agit aussi d'une bonne pratique pour l'environnement. En effet, les utilisateurs n'ont pas toujours conscience de ce qui ralentit un service numérique : la connexion réseau, le service numérique ou le terminal utilisé ?\nUn service numérique plus léger a, par conséquent, beaucoup moins besoin de ressources réseaux pour fonctionner.",
    "miseEnOeuvre_en": "Test the usability of the service with low-speed connections, measuring and improving response time. Content can be served in low-quality versions when necessary.",
    "miseEnOeuvre_fr": "Tester l'utilisabilité du service avec des connexions bas débit, mesurer et améliorer le temps de réponse. Les contenus peuvent être servis en qualité dégradées lorsque cela s'avère nécessaire.",
    "controle_en": "Test the usability of the service with low-speed connections (3G mobile and 512 Kbs broadband).",
    "controle_fr": "Tester l'utilisabilité du service avec des connexions bas débit (3G en mobilité et 512 Kbs en fixe)."
  },
  {
    "numero_en": "4.2",
    "numero_fr": "4.2",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service only contain animation, video and sound elements for which automatic playback has been disabled?",
    "critere_fr": "Le service numérique comporte-t-il uniquement des éléments animations, vidéos et sons dont la lecture automatique est désactivée ?",
    "objectif_en": "Avoid preloading content and launching it without the user's consent.",
    "objectif_fr": "Éviter de précharger des contenus et de les lancer sans consentement de l'utilisateur.",
    "miseEnOeuvre_en": "For example, avoid preloading and automatically playing videos, sounds, animations, carousels, etc.",
    "miseEnOeuvre_fr": "Par exemple, éviter de précharger et de lire automatiquement vidéos, sons, animations, carrousel, etc.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.3",
    "numero_fr": "4.3",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service only display content without infinite page scrolling?",
    "critere_fr": "Le service numérique affiche-t-il uniquement des contenus sans défilement de page infini ?",
    "objectif_en": "Avoid walls of content, infinite lists, infinite content sequences.",
    "objectif_fr": "Éviter le mur de contenus, la liste infinie, l'enchaînement infini de contenus.",
    "miseEnOeuvre_en": "Have clear pagination where content is loaded at the user's request and not as content is scrolled through.",
    "miseEnOeuvre_fr": "Mettre en place une pagination claire dont le chargement du contenu est à la demande de l'utilisateur et non au défilement du contenu.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.4",
    "numero_fr": "4.4",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service optimise the navigation path for each main feature?",
    "critere_fr": "Le service numérique optimise-t-il le parcours de navigation pour chaque fonctionnalité principale ?",
    "objectif_en": "Minimise the time that the user has to spend on the digital service.",
    "objectif_fr": "Minimiser le temps passé par l'utilisateur sur le service numérique.",
    "miseEnOeuvre_en": "During the design phase, eliminate non-essential functionality and optimise the navigation path(s) for each main functional unit making up the digital service. Then, look at the visit and usage statistics, alongside the means for observing UX (user experience), in order to optimise this path.\nFor example, a main functional unit of the service may be 'book a ticket', 'search for a term', 'find an address', 'contact support', 'chat', etc.\n A qualitative analysis first needs to be conducted, which can then be supplemented by a quantitative analysis: \n* Properly define the main functional units of the service (in the sense of the Life Cycle Assessment).\n* Leverage all the resources and tools available in the UX in order to understand how users are actually using the service, particularly with regard to their browsing paths for each main functional unit.\n* Implement a non-intrusive analysis system that respects privacy in order to identify the typical paths that users take when using the digital service. Analyse these statistics from time to time to improve the user experience and the environmental impact of these \"critical paths\".\n* Also measure the technical indicators for the identified paths: number of requests, size of resources downloaded and convert them into environmental impact indicators.",
    "miseEnOeuvre_fr": "Durant la phase de conception, éliminer les fonctionnalités non essentielles et optimiser le ou les parcours de navigation pour chaque unité fonctionnelle principale du service numérique. Puis, observer les statistiques de fréquentation et d'usage, couplé aux moyens d'observation UX (expérience utilisateur), afin d'améliorer cette optimisation de parcours.\nPar exemple, une unité fonctionnelle principale du service peut être \"réserver un billet\", \"rechercher un terme\", \"trouver une adresse\", \"contacter le support\", \"discuter\", etc.\nIl s'agit d'abord d'une analyse qualitative à mettre en place et pouvant être complétée par une analyse quantitative :\n* Bien définir les unités fonctionnelles principales du service (au sens de l'Analyse de Cycle de Vie).\n* Exploiter toutes les ressources et les outils disponibles en UX afin de comprendre au mieux les usages des utilisateurs, notamment en ce qui concerne leurs parcours de navigation de chaque unité fonctionnelle principale.\n* Mettre en place un système d'analyse non intrusif et respectueux de la vie privée afin d'identifier les parcours-type sur le service numérique. Analyser de temps en temps ces statistiques pour pouvoir améliorer l'expérience utilisateur et les impacts environnementaux de ces \"chemins-critiques\".\n* Mesurer également les indicateurs techniques des parcours identifiés : nombre de requêtes, poids des ressources téléchargées et les traduire en indicateurs d'impacts environnementaux.",
    "controle_en": "* UX tools for design, optimisation and continuous monitoring: card sorting, polling, interviews, user surveys, U-tests, etc.\n* Monitoring implementation of usage statistics.\n* Life cycle analysis.",
    "controle_fr": "* Outils UX de conception, d'optimisation et de contrôle continu : tri de carte, sondage, interviews, enquêtes utilisateurs, tests-U, etc.\n* Contrôle de la mise en place des statistiques d'usage.\n* Analyse de cycle de vie."
  },
  {
    "numero_en": "4.5",
    "numero_fr": "4.5",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service allow the user to decide whether to activate a third-party service?",
    "critere_fr": "Le service numérique permet-il à l'utilisateur de décider de l'activation d'un service tiers ?",
    "objectif_en": "Limit the loading of third-party services that are not required for the service to function properly. For example, without cookies enabled, some video players are disabled and will ask for user consent before playing a video.",
    "objectif_fr": "Limiter le chargement de services tiers non nécessaires au bon fonctionnement du service. Par exemple, sans activation des cookies, certains lecteurs vidéo sont désactivés et en attente de consentement pour pouvoir visionner la vidéo.",
    "miseEnOeuvre_en": "Load non-essential content only at the explicit request of the user. This criterion is one of the obligations formalised in the GDPR: consent is requested before third-party content is loaded.",
    "miseEnOeuvre_fr": "Charger des contenus non indispensables qu'à la demande explicite de l'utilisateur. Ce critère rejoint une des obligations du RGPD sur la demande de consentement avant de charger du contenu tiers.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.6",
    "numero_fr": "4.6",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service use mainly native functional components forming part of the operating system, browser or programming language used?",
    "critere_fr": "Le service numérique utilise-t-il majoritairement des composants fonctionnels natifs du système d'exploitation, du navigateur ou du langage utilisé ?",
    "objectif_en": "Functional components are ' for example ' interface components (menu, button, form, etc.). Generally, a system's native components require relatively few resources to function, unlike components developed as part of an overlay.",
    "objectif_fr": "Les composants fonctionnels sont par exemple des composants d'interface (menu, bouton, formulaire...). Généralement, les composants natifs d'un système n'ont besoin que de peu de ressources pour fonctionner, contrairement à des composants développés en surcouche.",
    "miseEnOeuvre_en": "Give preference to using functional components that are native to the operating system, browser or language used in order to meet the need.",
    "miseEnOeuvre_fr": "Privilégier l'utilisation des composants fonctionnels natifs du système d'exploitation, du navigateur ou du langage utilisé pour répondre au besoin.",
    "controle_en": "Otherwise, assess the need to have chosen to use non-native components (technical constraint for example?).",
    "controle_fr": "Si c'est le cas, évaluer la nécessité d'avoir choisi d'utiliser des composants non natifs (contrainte technique par exemple ?)."
  },
  {
    "numero_en": "4.7",
    "numero_fr": "4.7",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service only use video, audio and animated content that includes information?",
    "critere_fr": "Le service numérique utilise-t-il uniquement du contenu vidéo, audio et animé porteur d'informations ?",
    "objectif_en": "Remove the media resources downloaded and used for the purposes of making the service aesthetic.",
    "objectif_fr": "Supprimer le poids des ressources médias téléchargées et utilisées pour l'esthétisme du service.",
    "miseEnOeuvre_en": "Check the utility of all video, animation and audio used: do these media elements carry information? Or are they only used for decorative purposes?\nQuestion the utility of using decorative video, animation and audio content.\nNon-decorative micro interface animations that provide the user with information (UX) are authorised.",
    "miseEnOeuvre_fr": "Vérifier la pertinence sur l'usage de vidéos, animations et audios : ces médias sont-ils porteurs ou non d'une information (VS ces médias ne sont utilisés qu'à des fins décoratifs).\nS'interroger sur la pertinence d'utiliser des contenus vidéo, d'animation et audio décoratifs.\nLes micro-animations d'interface non décoratifs et apportant une information à l'utilisateur (UX) sont autorisées.",
    "controle_en": "Assess the utility of displaying decorative animation, video or audio content.",
    "controle_fr": "Évaluer la pertinence du choix d'afficher une animation ou une vidéo décorative, ou encore un contenu audio décoratif."
  },
  {
    "numero_en": "4.8",
    "numero_fr": "4.8",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service use text or images instead of video, audio or animated content whenever possible?",
    "critere_fr": "Le service numérique utilise-t-il du texte ou de l'image au lieu de contenu vidéo, audio ou animé lorsque cela est possible ?",
    "objectif_en": "Reduce the size of the resources used, bearing in mind that a video element is generally much bigger than a text containing images.",
    "objectif_fr": "Réduire le poids des ressources utilisées, sachant qu'une vidéo pèse généralement beaucoup plus lourd qu'un texte contenant des images.",
    "miseEnOeuvre_en": "Question the need to display media (video, animation or audio recording) very early on and choose the most efficient solution possible while at the same time meeting the user's needs.",
    "miseEnOeuvre_fr": "Questionner le besoin d'afficher un média (vidéo, animation ou enregistrement audio), très en amont et choisir la solution la plus sobre possible tout en répondant au besoin utilisateur.",
    "controle_en": "Assess the utility of choosing to display a video or play an animation or audio recording.",
    "controle_fr": "Évaluer la pertinence du choix d'affichage d'une vidéo, d'une animation ou d'un enregistrement audio."
  },
  {
    "numero_en": "4.9",
    "numero_fr": "4.9",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service allow animations, scrolling or flashing to be paused?",
    "critere_fr": "Le service numérique permet-il de mettre en pause les animations, défilement ou clignotement ?",
    "objectif_en": "Give control to the user so they can limit the use of unnecessary resources.",
    "objectif_fr": "Donner le contrôle à l'utilisateur pour limiter l'usage de ressources non nécessaires.",
    "miseEnOeuvre_en": "Systematically offer the user the option to pause animations.",
    "miseEnOeuvre_fr": "Proposer systématiquement une possibilité à l'utilisateur de mettre en pause les animations.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.10",
    "numero_fr": "4.10",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service use mainly operating system fonts?",
    "critere_fr": "Le service numérique utilise-t-il majoritairement des polices de caractères du système d'exploitation ?",
    "objectif_en": "Reduce the quantity of custom fonts used and the amount of data that they require. Whenever possible, give preference to using system fonts when customisation is not necessary.",
    "objectif_fr": "Réduire la quantité et le poids des polices personnalisées utilisées. Privilégier l'utilisation des polices systèmes lorsque la personnalisation n'est pas nécessaire.",
    "miseEnOeuvre_en": "For example, set a target of using a maximum of two different fonts and no more than four variants in total. Check, for example, the compression of fonts or the use of any necessary glyphs.\nFor a website, also pay attention to the loading mode: blocking, non-blocking...",
    "miseEnOeuvre_fr": "Par exemple, se fixer comme objectif de n'utiliser qu'au maximum, deux polices différentes et au maximum quatre variantes au total. Vérifier par exemple la compression des polices ou l'usage des glyphes nécessaires.\nDans un contexte de site web, faire attention aussi sur le mode de chargement : bloquant, non bloquant...",
    "controle_en": "Assess the number of character fonts used and the amount of data that they require.",
    "controle_fr": "Évaluer le nombre et poids des polices de caractères utilisées."
  },
  {
    "numero_en": "4.11",
    "numero_fr": "4.11",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service limit server requests during user input?",
    "critere_fr": "Le service numérique limite-t-il les requêtes serveur lors de la saisie utilisateur ?",
    "objectif_en": "Avoid making unnecessary client/server requests. For example, when a form is being filled in, are results suggested, etc.?",
    "objectif_fr": "Éviter de réaliser des requêtes clients / serveurs inutiles. Par exemple dans un contexte de formulaire, de suggestion de résultats, etc.",
    "miseEnOeuvre_en": "For autocompletion, wait until you have at least 3 characters and 200 ms after entry before launching a network request.",
    "miseEnOeuvre_fr": "Pour une aide à la saisie (\"autocompletion\"), attendre par exemple d'avoir 3 caractères et 200 ms après saisie avant de lancer une requête réseau.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.12",
    "numero_fr": "4.12",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service inform the user of the expected input format before validation?",
    "critere_fr": "Le service numérique informe-t-il l'utilisateur du format de saisie attendu avant sa validation ?",
    "objectif_en": "Limit client/server exchanges by verifying the input on the user terminal side.",
    "objectif_fr": "Limiter les échanges clients / serveurs en vérifiant la saisie du côté du terminal utilisateur.",
    "miseEnOeuvre_en": "Check the expected formats for user input before submitting the form and indicate input errors.",
    "miseEnOeuvre_fr": "Vérifier les formats attendus lors de la saisie de l'utilisateur avant soumission du formulaire et indiquer les erreurs de saisie.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.13",
    "numero_fr": "4.13",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service check the inputs and mandatory data formats when submitting a form without a server request where possible?",
    "critere_fr": "Le service numérique vérifie-t-il les saisies et les formats de données obligatoires à la soumission d'un formulaire sans requête serveur lorsque c'est possible ?",
    "objectif_en": "The aim is to avoid unnecessary server requests. In some cases it is not possible to check on the client side at the end of the form, so the check will be on the server side.",
    "objectif_fr": "L'objectif est d'éviter les requêtes serveur inutiles. Dans certains cas il n'est pas possible de vérifier côté client en fin de formulaire, la vérification sera alors du côté serveur.",
    "miseEnOeuvre_en": "Validate entries and mandatory data formats when submitting a form without a server request where possible. Note: pre-validating data on the front end does not mean that validation on the back end no longer has to be performed.",
    "miseEnOeuvre_fr": "Valider les saisies et les formats de données obligatoires à la soumission d'un formulaire sans requête serveur lorsque cela est possible. Attention : pré-valider les données côté frontend n'exempt pas la validation côté backend.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.14",
    "numero_fr": "4.14",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service inform the user of the expected sizes and formats of the files before the transfer?",
    "critere_fr": "Le service numérique informe-t-il l'utilisateur, avant le transfert, des poids et formats de fichier attendus ?",
    "objectif_en": "Limit the sharing of large files between the client and server by informing the user of the expected prerequisites.",
    "objectif_fr": "Limiter les échanges clients / serveurs de fichiers volumineux en informant l'utilisateur des prérequis attendus.",
    "miseEnOeuvre_en": "Inform the user, prior to the transfer, of the expected file sizes and formats: a file type, a maximum image size, etc.",
    "miseEnOeuvre_fr": "Indiquer à l'utilisateur, avant le transfert, des poids et des formats de fichier attendus : un type de fichier, une taille max. d'image, etc.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.15",
    "numero_fr": "4.15",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service check size and format limits on the files that can be sent by the user?",
    "critere_fr": "Le service numérique vérifie-t-il des limites de poids et de formats sur les fichiers pouvant être transmis par l'utilisateur ?",
    "objectif_en": "Limit the sharing of large files between the client and server by imposing limits on the user.",
    "objectif_fr": "Limiter les échanges clients / serveurs de fichiers volumineux en imposant des limites à l'utilisateur.",
    "miseEnOeuvre_en": "Submitting the form is not possible if the indicated file size and format requirements are not met.\nHowever, not applicable in certain contexts where the file requested may be potentially quite large, for example for an online process.",
    "miseEnOeuvre_fr": "La soumission du formulaire n'est pas possible si les prérequis indiqués de poids et de formats de fichiers ne sont pas respectés.\nAttention cependant, non applicable dans certains contextes où le fichier demandé peut être potentiellement assez conséquent, par exemple pour une démarche en ligne.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.16",
    "numero_fr": "4.16",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service inform the user that using a particular feature has significant environmental impacts?",
    "critere_fr": "Le service numérique indique-t-il à l'utilisateur que l'utilisation d'une fonctionnalité a des impacts environnementaux importants ?",
    "objectif_en": "Detail the environmental impacts of the most resource-hungry operations for the user.\nInform users upstream of the environmental impacts of the most resource-hungry operations before the user uses a particular feature, when the operation in question is more resource-hungry than the rest of the service.",
    "objectif_fr": "Matérialiser pour l'utilisateur les impacts environnementaux des actions les plus coûteuses.\nInformer les utilisateurs en amont des impacts environnementaux avant l'utilisation d'une fonctionnalité, lorsque cette dernière est plus coûteuse par rapport au reste du service.",
    "miseEnOeuvre_en": "For example, for each downloadable file, video or media element accessed, or for a lengthy process, such as data export, information about the size of the file or the time required for the operation is displayed to the user beforehand.\nThere is no need to provide environmental impact equivalents. If they are available, the source and methodology should be specified. However, care must be taken to ensure that this information is multi-criteria, not just CO2 equivalent.",
    "miseEnOeuvre_fr": "Par exemple, pour chaque fichier téléchargeable, vidéo ou média consulté, ou pour un traitement long, comme un export de données, une information relative au poids du fichier ou le temps requis pour l'opération est préalablement affichée à l'utilisateur.\nIl n'est pas nécessaire de fournir des équivalences en impacts environnementaux. Si ces dernières sont disponibles, il faut préciser la source et la méthodologie. Toutefois, il faut veiller à ce que ces informations soient en multicritères, pas uniquement en équivalent CO2.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.17",
    "numero_fr": "4.17",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service provide notifications only when necessary?",
    "critere_fr": "Le service numérique propose-t-il des notifications uniquement lorsque c'est nécessaire ?",
    "objectif_en": "Reduce the use of IT resources by not attracting unnecessary user attention or consuming unnecessary IT resources.",
    "objectif_fr": "Réduire l'usage de ressources informatiques en évitant d'attirer inutilement l'attention de l'utilisateur ou en consommant inutilement des ressources informatiques.",
    "miseEnOeuvre_en": "The notifications envisaged by the digital service are designed to benefit the user in terms of need. Notifications also avoid information being shared redundantly via various channels (SMS, email, application notification, interface notification, pop-in, etc.).",
    "miseEnOeuvre_fr": "Les notifications envisagées par le service numérique sont dans l'intérêt de l'utilisateur en terme de besoin. Les notifications évitent également la multiplications sur différents canaux redondants (SMS, mails, notification d'application, notification d'interface, pop-in, etc.).",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.18",
    "numero_fr": "4.18",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service provide the user with the means to manage the notifications they receive?",
    "critere_fr": "Le service numérique permet-il à l'utilisateur de contrôler les notifications qu'il reçoit ?",
    "objectif_en": "Reduce the use of IT resources by not attracting unnecessary user attention.",
    "objectif_fr": "Réduire l'usage de ressources informatiques en évitant d'attirer inutilement l'attention de l'utilisateur.",
    "miseEnOeuvre_en": "The user can disable notifications or choose how often they are received.",
    "miseEnOeuvre_fr": "L'utilisateur peut désactiver les notifications ou choisir la fréquence de réception de ces notifications.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "4.19",
    "numero_fr": "4.19",
    "thematique_en": "UX/UI",
    "thematique_fr": "UX/UI",
    "critere_en": "Does the digital service provide the user with the means to control their content and services to reduce environmental impacts?",
    "critere_fr": "Le service numérique fournit-il à l'utilisateur un moyen de contrôle sur ses contenus et ses services afin de réduire les impacts environnementaux ?",
    "objectif_en": "Empower users to limit the environmental impact of their use.",
    "objectif_fr": "Donner de l'autonomie à l'utilisateur pour limiter les impacts environnementaux de ses usages.",
    "miseEnOeuvre_en": "Examples: functions providing the means to choose the definition of the image to be downloaded, options to choose media resolutions (videos, sounds, images, documents), to disable the display of media, etc.",
    "miseEnOeuvre_fr": "Exemples : des fonctions proposant de choisir la définition de l'image à télécharger, des possibilités de choix en résolutions des médias (vidéos, sons, images, documents), de désactiver l'affichage des médias, etc.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "5.1",
    "numero_fr": "5.1",
    "thematique_en": "Content",
    "thematique_fr": "Contenus",
    "critere_en": "Does the digital service use a file format that is appropriate for the content and the context within which each image is viewed?",
    "critere_fr": "Le service numérique utilise-t-il un format de fichier adapté au contenu et au contexte de visualisation de chaque image ?",
    "objectif_en": "Reduce the size of files downloaded by users.",
    "objectif_fr": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
    "miseEnOeuvre_en": "Choose an image format appropriate for the type of image and the context within which it is displayed: use vector format such as SVG when possible (illustrations, icons, logos, graphs, etc.), JPG format for photos and PNG format for illustrations with solid colours.",
    "miseEnOeuvre_fr": "Choisir le format image adapté à la typologie d'image et au contexte d'affichage : utiliser le format vectoriel comme le svg lorsque cela est possible (illustrations, icones, logos, graphes...), le format jpg pour des photos et le format png pour des illustrations avec aplats de couleurs.",
    "controle_en": "Assess the appropriateness of the image format displayed.",
    "controle_fr": "Évaluer la pertinence du format de l'image affichée."
  },
  {
    "numero_en": "5.2",
    "numero_fr": "5.2",
    "thematique_en": "Content",
    "thematique_fr": "Contenus",
    "critere_en": "Does the digital service have images with a level of compression that is appropriate for the content and the context within which they are viewed?",
    "critere_fr": "Le service numérique propose-t-il des images dont le niveau de compression est adapté au contenu et au contexte de visualisation ?",
    "objectif_en": "Reduce the size of files downloaded by users.",
    "objectif_fr": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
    "miseEnOeuvre_en": "For example, when generating a JPEG image using editing software, 60% compression may be visually acceptable. In PNG format, reducing the colour palette is recommended.\n\nFlatten the layers to generate an SVG vector format file. Minimise and further optimise compression using dedicated tools.",
    "miseEnOeuvre_fr": "Ex. Lors de la génération d'une image JPEG depuis un logiciel de retouche, la compression à 60 % peut être visuellement acceptable. En PNG la réduction de la palette des couleurs est conseillée.\n\nAplatir les calques pour générer un format vectoriel SVG. Minifier et optimiser encore plus la compression en utilisant des outils dédiés.",
    "controle_en": "Assess the quality and size of the displayed image.",
    "controle_fr": "Évaluer la qualité et le poids de l'image affichée."
  },
  {
    "numero_en": "5.3",
    "numero_fr": "5.3",
    "thematique_en": "Content",
    "thematique_fr": "Contenus",
    "critere_en": "Does the digital service use a file format that is appropriate for the content and the context within which each video is viewed?",
    "critere_fr": "Le service numérique utilise-t-il un format de fichier adapté au contenu et au contexte de visualisation pour chaque vidéo ?",
    "objectif_en": "Sometimes video content is in high definition when the viewing context does not require it. The aim is to reduce the size of files downloaded by users.",
    "objectif_fr": "Il arrive parfois que le contenu vidéo soit en haute définition alors que le contexte de visualisation n'en a pas besoin. L'objectif est de réduire le poids des fichiers téléchargés par les utilisateurs.",
    "miseEnOeuvre_en": "For example, avoid videos with a definition of 1080p or higher displayed on the website when the target or detected device is a smartphone. If it is not possible to implement this adaptation based on the target device, use video content that is as low-definition as possible without compromising people's ability to understand it.",
    "miseEnOeuvre_fr": "Par exemple, éviter les vidéos avec une définition de 1080p ou plus affichées sur le site web quand le terminal cible ou détecté est un smartphone. S'il n'est pas possible de mettre en place cette adaptation selon le terminal cible, utiliser un contenu vidéo avec la plus faible définition possible sans que cela n'altère sa compréhension.",
    "controle_en": "Test video playback on different devices and check that the videos are in a suitable format.",
    "controle_fr": "Tester la lecture des vidéos sur différents terminaux et vérifier que ces vidéos ont un format adapté."
  },
  {
    "numero_en": "5.4",
    "numero_fr": "5.4",
    "thematique_en": "Content",
    "thematique_fr": "Contenus",
    "critere_en": "Does the digital service have videos with a level of compression that is appropriate for the content and the context within which they are viewed?",
    "critere_fr": "Le service numérique propose-t-il des vidéos dont le niveau de compression est adapté au contenu et au contexte de visualisation ?",
    "objectif_en": "Reduce the size of files downloaded by users.",
    "objectif_fr": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
    "miseEnOeuvre_en": "For example, optimise the format's bitrate.",
    "miseEnOeuvre_fr": "Par exemple, optimisation du Bitrate (débit) au sein du format.",
    "controle_en": "Assess the quality and size of the displayed video.",
    "controle_fr": "Évaluer la qualité et le poids de la vidéo proposée."
  },
  {
    "numero_en": "5.5",
    "numero_fr": "5.5",
    "thematique_en": "Content",
    "thematique_fr": "Contenus",
    "critere_en": "Does the digital service use a file format that is appropriate for the content and the context within which each piece of audio content is listened to?",
    "critere_fr": "Le service numérique utilise-t-il un format de fichier adapté au contenu et au contexte d'écoute de chaque contenu audio ?",
    "objectif_en": "Reduce the size of files downloaded by users.",
    "objectif_fr": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
    "miseEnOeuvre_en": "For example, use MP3, OGG or AAC instead of FLAC, AIFF or WAV.",
    "miseEnOeuvre_fr": "Utiliser par exemple le MP3, OGG ou AAC au lieu du FLAC, AIFF ou WAV.",
    "controle_en": "Assess the appropriateness of the audio file format for the content: music, speech, etc.",
    "controle_fr": "Évaluer la pertinence du format de fichier audio par rapport au contenu proposé : musique, parlé, etc."
  },
  {
    "numero_en": "5.6",
    "numero_fr": "5.6",
    "thematique_en": "Content",
    "thematique_fr": "Contenus",
    "critere_en": "Does the digital service have audio content with a level of compression that is appropriate for the content and the context within which it is listened to?",
    "critere_fr": "Le service numérique propose-t-il des contenus audio dont le niveau de compression est adapté au contenu et au contexte d'écoute ?",
    "objectif_en": "Reduce the size of files downloaded by users.",
    "objectif_fr": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
    "miseEnOeuvre_en": "Examples: \n- optimise the bitrate, compression rate and frequency of the format, \n choose stereo for music or mono for dialogue, \n- avoid a size (in megabytes) to length (in minutes) ratio greater than 1.",
    "miseEnOeuvre_fr": "Exemples :\n- optimisation du Bitrate (débit), du Ratio (Taux de compression) et de la Fréquence au sein du format,\n- choix adapté Stéréo pour de la musique ou Mono pour des dialogues,\n- éviter le ratio poids en mega-octet/durée en minute supérieur à 1.",
    "controle_en": "Assess the appropriateness of the audio file size for the content.",
    "controle_fr": "Évaluer la pertinence du poids de fichier audio par rapport au contenu proposé."
  },
  {
    "numero_en": "5.7",
    "numero_fr": "5.7",
    "thematique_en": "Content",
    "thematique_fr": "Contenus",
    "critere_en": "Does the digital service use a file format that is appropriate for the content and the context within which each document is used?",
    "critere_fr": "Le service numérique utilise-t-il un format de fichier adapté au contenu et au contexte d'utilisation pour chaque document ?",
    "objectif_en": "Reduce the size of files downloaded by users.",
    "objectif_fr": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
    "miseEnOeuvre_en": "E.g.: use web-optimised PDFs (i.e. with 72 dpi images) for online viewing and HD print-optimised PDFs (i.e. with 150 or 300 dpi images) for use in HD printing.",
    "miseEnOeuvre_fr": "Ex : réserver un PDF optimisé web (donc comportant des visuels en 72 dpi) pour une visualisation en ligne et un PDF optimisé impression HD (donc comportant des visuels en 150 ou 300 dpi) pour une utilisation destinée à l'impression HD.",
    "controle_en": "Assess the appropriateness of the documents.",
    "controle_fr": "Évaluer la pertinence du format du document proposé."
  },
  {
    "numero_en": "5.8",
    "numero_fr": "5.8",
    "thematique_en": "Content",
    "thematique_fr": "Contenus",
    "critere_en": "Does the digital service have documents with a level of compression that is appropriate for the content and the context within which they are used?",
    "critere_fr": "Le service numérique propose-t-il des documents dont le niveau de compression est adapté au contenu et au contexte d'utilisation ?",
    "objectif_en": "Reduce the size of files downloaded by users.",
    "objectif_fr": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
    "miseEnOeuvre_en": "Example: optimise the compression settings to generate PDFs with a resolution of 72 dpi for all media in the document.",
    "miseEnOeuvre_fr": "Exemple : optimiser les paramètres de compression pour générer un PDF en résolution 72 dpi pour tous les médias du document.",
    "controle_en": "Assess the size of the document in relation to its content.",
    "controle_fr": "Évaluer le poids du document par rapport à son contenu."
  },
  {
    "numero_en": "5.9",
    "numero_fr": "5.9",
    "thematique_en": "Content",
    "thematique_fr": "Contenus",
    "critere_en": "Does the digital service have a strategy for archiving and deleting obsolete or outdated content, either automatically or manually?",
    "critere_fr": "Le service numérique a-t-il une stratégie d'archivage et de suppression, automatiques ou manuelles, des contenus obsolètes ou périmés ?",
    "objectif_en": "Remove unnecessary data from databases and physical servers.",
    "objectif_fr": "Alléger les bases de données et les serveurs physiques de données non utiles.",
    "miseEnOeuvre_en": "Define a strategy for archiving and deleting the digital service's obsolete, outdated or unnecessary content. This strategy can be automatic by setting an expiry date and implementing an automatic archiving and/or purging process.",
    "miseEnOeuvre_fr": "Définir une stratégie d'archivage et de suppression des contenus obsolètes, périmés, dépassés ou inutiles à conserver dans le service numérique. Cette stratégie peut être automatique en définissant une date d’expiration et un processus d'archivage et/ou de purge automatique.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "6.1",
    "numero_fr": "6.1",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Does the digital service have a maximum weight per screen?",
    "critere_fr": "Le service numérique s'astreint-il à un poids maximum par écran ?",
    "objectif_en": "Reduce or limit downloaded data",
    "objectif_fr": "Réduire ou limiter les données téléchargées",
    "miseEnOeuvre_en": "The term 'screen' is used here to mean \n'virtual screen'\n and not physical screen. If the digital service is a website, the screen refers to the page, for an API, the screen refers to the server response.\nDefine and monitor an indicator for the maximum size for each screen, taking into account all downloaded resources (interface components, data, content, scripts, stylesheets, etc.). For example, for a web page (with all resources loaded) that is 2 MB, the goal would be to get it down to 500 KB. Depending on the context, this target may be much lower.",
    "miseEnOeuvre_fr": "Par écran, il est entendu ici \"écran virtuel\" et non physique. Si le service numérique est un site web, l'écran désigne la page, pour une API, l'écran désigné la réponse du serveur.\nDéfinir et suivre un indicateur poids maximum par écran, en tenant compte de toutes les ressources téléchargées (composants d'interface, données, contenus, scripts, feuilles de style...). Par exemple pour une page web (avec toutes les ressources chargées) qui pèse 2 Mo, l'objectif serait de descendre à 500 Ko. Selon le contexte, cet objectif peut être beaucoup plus bas.",
    "controle_en": "What is the maximum size per screen?",
    "controle_fr": "Quel est le poids maximum par écran défini ?"
  },
  {
    "numero_en": "6.2",
    "numero_fr": "6.2",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Does the digital service have a limit on the number of requests per screen?",
    "critere_fr": "Le service numérique s'astreint-il à une limite de requêtes par écran ?",
    "objectif_en": "Reduce or limit client-server exchanges.",
    "objectif_fr": "Réduire ou limiter les échanges client - serveur.",
    "miseEnOeuvre_en": "The term 'screen' is used here to mean \n'virtual screen'\n and not physical screen. If the digital service is a website, the screen refers to the page, for an API, the screen refers to the server response.\nDefine and monitor an indicator for the maximum number of client / server requests for each screen, taking into account all downloaded resources (interface components, data, content, scripts, stylesheets, etc.). For example, for a website, it would be desirable to have fewer than 30 requests per page instead of 100.\nNote that the number of requests alone cannot guarantee the efficiency of the digital service, since one request is enough to load several dozen megabytes' worth of data. Care must be taken to validate all the criteria of this reference framework, in particular criterion 6.1 on limiting the maximum amount of data per screen.",
    "miseEnOeuvre_fr": "Par écran, il est entendu ici \"écran virtuel\" et non physique. Si le service numérique est un site web, l'écran désigne la page, pour une API, l'écran désigné la réponse du serveur.\nDéfinir et suivre un indicateur nombre de requêtes client/serveur maximum par écran, en tenant compte de toutes les ressources téléchargées (composants d'interface, données, contenus, scripts, feuilles de style...). Par exemple, pour une site web, il serait intéressant d'avoir moins de 30 requêtes par page au lieu de 100.\nAttention, le nombre de requêtes seul ne peut être garant de la sobriété du service numérique, puisqu'une seule suffit à charger plusieurs dizaines de mégaoctets. Il faut bien veiller à valider tous les critères de ce référentiel, notamment le critère 6.1 sur la limitation du poids maximum par écran.",
    "controle_en": "What is the maximum number of requests per screen?",
    "controle_fr": "Quel est le nombre de requêtes maximum par écran défini ?"
  },
  {
    "numero_en": "6.3",
    "numero_fr": "6.3",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Does the digital service use caching mechanisms for all transferred content over which it has control?",
    "critere_fr": "Le service numérique utilise-t-il des mécanismes de mises en cache pour la totalité des contenus transférés dont il a le contrôle ?",
    "objectif_en": "Reduce the quantity of data exchanged.",
    "objectif_fr": "Réduire le poids des données échangées.",
    "miseEnOeuvre_en": "The caching strategy must be adapted to the application context and usage scenario. Controlling offline mode is sometimes very useful, sometimes not. Implement a user-side cache mechanism, on the frontend (HTTP cache for example).",
    "miseEnOeuvre_fr": "La stratégie de cache doit être adaptée au contexte d'application et au scénario d'usage. La gestion du mode déconnecté (offline) est parfois très pertinent, parfois non. Mettre en place un mécanisme de cache côté utilisateur, en frontend (cache HTTP par exemple).",
    "controle_en": "Check the implementation",
    "controle_fr": "Vérifier la mise en œuvre"
  },
  {
    "numero_en": "6.4",
    "numero_fr": "6.4",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Has the digital service implemented compression techniques on all transferred assets over which it has control?",
    "critere_fr": "Le service numérique a-t-il mis en place des techniques de compression sur la totalité des ressources transférées dont il a le contrôle ?",
    "objectif_en": "Reduce or limit downloaded data.",
    "objectif_fr": "Réduire ou limiter les données téléchargées.",
    "miseEnOeuvre_en": "Compression, minification of script files for example. However, be careful not to consume resources if there is a need for computing power to \n'decompress'\n the files: systematically compressing .tgz type small files, for example, can be counter-productive.This criterion only applies to text files (HTML, CSS, JavaScript, for example). Not to be confused with criterion 5.2 on image compression.",
    "miseEnOeuvre_fr": "Compression, minification des fichiers de scripts par exemple. Attention toutefois à ne pas générer de la consommation de ressource si il y a besoin de puissance de calcul pour \"décompresser\" les fichiers : la compression systématique de type .tgz par exemple pour des petits fichiers peut être contre-productif.\nCe critère s'applique uniquement aux fichiers texte (HTML, CSS, javascript par exemple). Ne pas confondre avec le critère 5.2 sur la compression des images.",
    "controle_en": "Check that downloaded files are compressed.",
    "controle_fr": "Vérifier que les fichiers téléchargés sont compressés."
  },
  {
    "numero_en": "6.5",
    "numero_fr": "6.5",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Does the digital service display predominantly graphics and media the original dimensions of which match the dimensions of the context in which they are displayed?",
    "critere_fr": "Le service numérique affiche-t-il majoritairement des éléments graphiques et des médias dont les dimensions d'origine correspondent aux dimensions du contexte d'affichage ?",
    "objectif_en": "Reduce or limit downloaded data.",
    "objectif_fr": "Réduire ou limiter les données téléchargées.",
    "miseEnOeuvre_en": "For example, when adding media or graphic elements to the digital service, the display dimensions are required. Another possibility, which applies especially to images, resizing is performed on the server side when a contributor adds a file.\nAn exception to this rule: images for Retina screens (the displayed image the original size of which is generally greater than the context in which it is displayed because the device pixel ratio is greater for Retina images).",
    "miseEnOeuvre_fr": "Par exemple, lors de l'ajout des médias ou des éléments graphiques au service numérique, les dimensions d'affichages sont requises. Autre possibilité, valable surtout pour les images, un redimensionnement est réalisé coté serveur lors de l'ajout du fichier par un contributeur.\nException à cette règle : le cas des images pour écran Retina (l'image affichée dont la taille d'origine est généralement supérieure à son contexte d'affichage car la densité de pixels - device pixel ratio - est supérieure pour les images Retina).",
    "controle_en": "Check that the images or media used are displayed in their original size.",
    "controle_fr": "Contrôler que les images exploitées ou les médias utilisés sont affichés dans leur taille d'origine."
  },
  {
    "numero_en": "6.6",
    "numero_fr": "6.6",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Does the digital service offer a progressive loading mechanism for graphics and media that require it?",
    "critere_fr": "Le service numérique propose-t-il un mécanisme de chargement progressif pour les éléments graphiques et les médias le nécessitant ?",
    "objectif_en": "Reduce or limit downloaded data.",
    "objectif_fr": "Réduire ou limiter les données téléchargées.",
    "miseEnOeuvre_en": "Examples: streaming for video, loading only the images or resources displayed on the screen (\"lazy loading\")...",
    "miseEnOeuvre_fr": "Exemples : streaming pour la vidéo, chargement uniquement des images ou ressources affichées à l'écran (\"lazy loading\")...",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "6.7",
    "numero_fr": "6.7",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Does the digital service only load the components used within the libraries when possible?",
    "critere_fr": "Le service numérique se limite-t-il au chargement des composants utilisés au sein des bibliothèques lorsque cela est possible ?",
    "objectif_en": "Use only what is necessary for running the service, thus saving computer resources.",
    "objectif_fr": "N'utiliser que ce dont il est nécessaire pour le fonctionnement du service et économiser ainsi de la ressource informatique.",
    "miseEnOeuvre_en": "Load only the necessary components. Some libraries make components available for unitary use (e.g. [Bootstrap](https://getbootstrap.com/). Another example, the [French design system](https://www.systeme-de-design.gouv.fr/) is available in packaged form (style sheets and scripts) with all components. It is rarely necessary to use all the components. It is possible to load just the CSS and JavaScript files of the necessary components.",
    "miseEnOeuvre_fr": "Charger uniquement les composants nécessaires. Certaines bibliothèques rendent disponibles les composants pour une utilisation unitaire (par exemple [Bootstrap](https://getbootstrap.com/). Autre exemple, le [système de design de l'Etat](https://www.systeme-de-design.gouv.fr/) est disponible sous forme packagée (feuilles de style et scripts) avec tous les composants. Il est rarement nécessaire d'utiliser tous les composants. Il est possible de ne charger que les fichiers CSS et javascript des composants nécessaires.",
    "controle_en": "Check the content of the loaded libraries and how they are actually used.",
    "controle_fr": "Vérifier le contenu des bibliothèques chargées et leur utilisation effective."
  },
  {
    "numero_en": "6.8",
    "numero_fr": "6.8",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Does the digital service prevent the loading of unused resources and content for each feature from being triggered?",
    "critere_fr": "Le service numérique évite-t-il de déclencher le chargement de ressources et de contenus inutilisés pour chaque fonctionnalité ?",
    "objectif_en": "It is often easier for the development team to load all the components, packaged in a compressed file, irrespective of functionality. The result is that the user loads components that will not necessarily be used. Using only what is actually needed to run the service saves computer resources.",
    "objectif_fr": "Il est souvent plus simple pour l'équipe de développement de charger tous les composants, packagés dans un fichier compressé quelque soit la fonctionnalité. Il en résulte que l'utilisateur charge des composants qui ne seront pas forcément utilisés.\nN'utiliser que ce dont il est effectivement nécessaire pour le fonctionnement du service permet d'économiser ainsi de la ressource informatique.",
    "miseEnOeuvre_en": "Only load resources and components when they are actually being used.\nAlso see criterion 6.7 for interface components.",
    "miseEnOeuvre_fr": "Ne charger les ressources et des composants que lorsqu'ils sont effectivement utilisés.\nVoir aussi critère 6.7 pour les composants d'interface.",
    "controle_en": "Check the content of the loaded resources and how they are actually used.",
    "controle_fr": "Vérifier le contenu des ressources chargées et leur utilisation effective."
  },
  {
    "numero_en": "6.9",
    "numero_fr": "6.9",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Does the digital service use client-side storage of some resources to avoid unnecessary network exchanges?",
    "critere_fr": "Le service numérique utilise-t-il un stockage côté client de certaines ressources afin d'éviter des échanges réseaux inutiles ?",
    "objectif_en": "Reduce or limit client-server exchanges.",
    "objectif_fr": "Réduire ou limiter les échanges client - serveur.",
    "miseEnOeuvre_en": "For example, it is possible to store frequently used data in the web browser in order to limit exchanges with the server.",
    "miseEnOeuvre_fr": "Par exemple, il est possible de stocker des données souvent utilisées dans le navigateur web afin de limiter les échanges avec le serveur.",
    "controle_en": "Check that no feature makes identical and redundant requests.",
    "controle_fr": "Vérifier qu'aucune fonctionnalité ne fait des requêtes identiques et redondantes."
  },
  {
    "numero_en": "6.10",
    "numero_fr": "6.10",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Does the digital service restrict the use of sensors on user devices to just what the service requires rather than permanently?",
    "critere_fr": "Le service numérique restreint-il l'usage des capteurs des terminaux utilisateur au besoin du service plutôt qu'en permanence ?",
    "objectif_en": "Reduce or limit the quantity of data exchanged, including personal data (such as webcam, microphone or geolocation, for example) with the digital service.",
    "objectif_fr": "Réduire ou limiter les données échangées, dont des données personnelles (comme la webcam, le micro ou la géolocalisation, par exemple), avec le service numérique.",
    "miseEnOeuvre_en": "Validation of alert and consent mechanisms prior to any user-accepted device sensor activation.",
    "miseEnOeuvre_fr": "Validation de mécanismes d'alerte et de consentement avant tout déclenchement de capteur du terminal accepté par l'utilisateur.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "6.11",
    "numero_fr": "6.11",
    "thematique_en": "Frontend",
    "thematique_fr": "Frontend",
    "critere_en": "Does the digital service host the transferred static resources of which it is the sender on the same domain?",
    "critere_fr": "Le service numérique héberge-t-il les ressources statiques transférées dont il est l'émetteur sur un même domaine ?",
    "objectif_en": "Limit the number of different domains and therefore of servers used.",
    "objectif_fr": "Limiter le nombre de domaines différents et donc de serveurs sollicités.",
    "miseEnOeuvre_en": "Limit the number of different domains for the resources used in order to take advantage of the multiplexing offered by HTTP/2",
    "miseEnOeuvre_fr": "Limiter le nombre de domaines différents pour les ressources utilisées afin notamment de profiter du multiplexing proposé par HTTP/2",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "7.1",
    "numero_fr": "7.1",
    "thematique_en": "Backend",
    "thematique_fr": "Backend",
    "critere_en": "Does the digital service use a server cache system for the most used data?",
    "critere_fr": "Le service numérique a-t-il recours à un système de cache serveur pour les données les plus utilisées ?",
    "objectif_en": "Limit the consumption of computer resources.",
    "objectif_fr": "Limiter la consommation de ressources informatiques.",
    "miseEnOeuvre_en": "Identify the most used data, API entries, resources to be cached in order to avoid having to regenerate them. Allow for an expiry time to refresh them.",
    "miseEnOeuvre_fr": "Identifier les données, entrées API, ressources les plus utilisées à mettre en cache afin d'éviter de les regénérer. Prévoir une durée d'expiration pour les rafraichir.",
    "controle_en": "What server caches are in place?",
    "controle_fr": "Quels sont les caches serveur mis en place ?"
  },
  {
    "numero_en": "7.2",
    "numero_fr": "7.2",
    "thematique_en": "Backend",
    "thematique_fr": "Backend",
    "critere_en": "Is the digital service configured to transmit compressed content from the server to the client accepting it?",
    "critere_fr": "Le service numérique est-il configuré pour transmettre depuis le serveur des contenus compressés au client qui les accepte ?",
    "objectif_en": "Reduce the quantity of resources transferred over the network.",
    "objectif_fr": "Réduire la quantité de ressources transférées sur le réseau.",
    "miseEnOeuvre_en": "Implement end-to-end compression (e.g. https://developer.mozilla.org/fr/docs/Web/HTTP/Compression)",
    "miseEnOeuvre_fr": "Mettre en place une compression de bout en bout (par exemple : https://developer.mozilla.org/fr/docs/Web/HTTP/Compression)",
    "controle_en": "Check the implementation of data compression",
    "controle_fr": "Vérifier la mise en place d'une compression des données"
  },
  {
    "numero_en": "7.3",
    "numero_fr": "7.3",
    "thematique_en": "Backend",
    "thematique_fr": "Backend",
    "critere_en": "Does the digital service define retention periods for the data and documents that require them?",
    "critere_fr": "Le service numérique définit-il des durées de conservation sur les données et documents qui le nécessitent ?",
    "objectif_en": "Remove unnecessary data from databases and physical servers.",
    "objectif_fr": "Alléger les bases de données et les serveurs physiques de données non utiles.",
    "miseEnOeuvre_en": "Set expiry dates on data (files, database entries, etc.) so it can later be archived and/or deleted. See criterion: 7.4",
    "miseEnOeuvre_fr": "Définir des dates d'expiration sur les données (fichiers, entrées en base de données...) permettant par la suite d'archiver et/ou de supprimer cette donnée. Cf critère : 7.4",
    "controle_en": "Declarative request to the development team. This can be outlined in a data management policy/strategy document.",
    "controle_fr": "Demande déclarative à l'équipe de développement. Ceci peut être tracé dans un document sur la politique/stratégie de la gestion des données."
  },
  {
    "numero_en": "7.4",
    "numero_fr": "7.4",
    "thematique_en": "Backend",
    "thematique_fr": "Backend",
    "critere_en": "Does the digital service archive or delete data and documents after the retention period has expired?",
    "critere_fr": "Le service numérique archive-t-il ou supprime-t-il les données et documents après expiration de leur durée de conservation ?",
    "objectif_en": "Remove unnecessary data from databases and physical servers.",
    "objectif_fr": "Alléger les bases de données et les serveurs physiques de données non utiles.",
    "miseEnOeuvre_en": "Set up a process (preferably automatic) for archiving or deleting data (files, database entries, etc.) the retention period of which has expired. See criterion 7.3",
    "miseEnOeuvre_fr": "Mettre en place un processus (de préférence automatique) d'archivage ou de suppression des données (fichiers, entrées en base de données...) dont la durée de conservation est dépassée. Cf critère 7.3",
    "controle_en": "Monitor changes in the sizes of stored files and databases",
    "controle_fr": "Suivi de l'évolution du poids des fichiers stockés et des bases de données"
  },
  {
    "numero_en": "7.5",
    "numero_fr": "7.5",
    "thematique_en": "Backend",
    "thematique_fr": "Backend",
    "critere_en": "Does the digital service inform the user of ongoing processing in the background?",
    "critere_fr": "Le service numérique informe-t-il l'utilisateur d'un traitement en cours en arrière-plan ?",
    "objectif_en": "Avoid simultaneous requests caused by the user if they do not know that their operation is being taken into account.",
    "objectif_fr": "Éviter les requêtes simultanées provoquées par l'utilisateur s'il ne sait pas que son action est en cours de prise en compte.",
    "miseEnOeuvre_en": "Make the operation causing the processing unavailable (e.g. a form submission button) and inform the user that processing is in progress, possibly with an approximate processing time.",
    "miseEnOeuvre_fr": "Rendre indisponible l'action qui génère le traitement (par exemple un bouton de soumission de formulaire) et informer l'utilisateur que le traitement est en cours, éventuellement une durée approximative de traitement.",
    "controle_en": "Check implementation",
    "controle_fr": "Contrôler la mise en œuvre"
  },
  {
    "numero_en": "8.1",
    "numero_fr": "8.1",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service use a hosting service that is a signatory to the European Code of Conduct for Datacentres?",
    "critere_fr": "Le service numérique utilise-t-il un hébergement signataire du Code de Conduite européen sur les Datacentres ?",
    "objectif_en": "Encourage the use of hosting services that are committed to protecting the environment.",
    "objectif_fr": "Favoriser un hébergement qui a des engagements en faveur de l'environnement.",
    "miseEnOeuvre_en": "Select a hosting company committed to this approach or ask the hosting company for commitments in this respect.\nProposed by the European Commission, the European Code of Conduct is a voluntary initiative that was created in response to increased energy consumption by data centres and the need to reduce the impact on the environment of their operation. The aim is to inform and encourage data centre operators and owners to reduce energy consumption without hindering the critical function of data centres. The Code of Conduct aims to achieve this by improving our understanding of data centre energy demand, raising awareness and recommending best practice and targets for energy efficiency.\nSignatory parties must adhere to this code of conduct and abide by a set of commitments.Find out more about the [European code of conduct](https://e3p.jrc.ec.europa.eu/sites/default/files/documents/publications/jrc128184_jrc128184_jrc128184_2022_best_practice_guidelines-1.pdf) (pdf, 2022).",
    "miseEnOeuvre_fr": "Sélectionner un hébergeur engagé dans cette démarche.\nOu demander des engagements à l'hébergeur en ce sens.\nProposé par la Commission Européenne, le Code de conduite européen est une initiative volontaire qui a été créée en réponse à l'augmentation de la consommation d'énergie dans les centres de données et à la nécessité de réduire les impacts environnementaux. L'objectif est d'informer et d'encourager les opérateurs et les propriétaires de centres de données à réduire la consommation d'énergie sans entraver la fonction critique des centres de données. Le Code de conduite vise à atteindre cet objectif en améliorant la compréhension de la demande d'énergie au sein du centre de données, en sensibilisant et en recommandant les meilleures pratiques et objectifs en matière d'efficacité énergétique.\nLes parties signataires doivent suivre ce code de conduite et respecter un ensemble d'engagements.\nEn savoir plus sur le [Code de conduite européen](https://e3p.jrc.ec.europa.eu/sites/default/files/documents/publications/jrc128184_jrc128184_jrc128184_2022_best_practice_guidelines-1.pdf) (pdf, 2022).",
    "controle_en": "Proof of the hosting company's ratification of the Code of Conduct and associated actions",
    "controle_fr": "Justificatif de l'hébergeur de sa ratification du Code de Conduite et des actions associées"
  },
  {
    "numero_en": "8.2",
    "numero_fr": "8.2",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service use a hosting service that is committed to reducing its environmental impact?",
    "critere_fr": "Le service numérique utilise-t-il un hébergement ayant une démarche de réduction de son impact écologique ?",
    "objectif_en": "Encourage the use of a hosting company that has made environmental commitments, other than the European Code of Conduct for Data Centres.",
    "objectif_fr": "Favoriser un hébergement qui a des engagements en faveur de l'environnement, autres que le Code de Conduite européen sur les datacentres.",
    "miseEnOeuvre_en": "Select a hosting company that has made environmental commitments or request commitments from the hosting company in this regard: \n- charter, policy\n-, environmental certification: ISO14001, ISO50001, LEED, BREAM, HQE, etc.\n- measuring and reporting impacts\n- pooling of machine resources\n-type of cooling that uses renewable energy sources (water, air, etc.) or recovery of waste heat\n- environmental impact analysis of \"move to cloud\" for players which have their cloud on the premises? calculators made available by suppliers upstream of the migration?\n- how was the data centre created? soil artificialisation \n- etc.\n\nBeware of green washing when it comes to sharing information about net zero, a charter, a policy or an internal roadmap, without the possibility to verify its implementation, or without an independent third party certifying its implementation.",
    "miseEnOeuvre_fr": "Sélectionner un hébergeur ayant des engagements environnementaux ou demander des engagements à l'hébergeur en ce sens :\n- charte, politique\n- certification environnementale : ISO14001, ISO50001, LEED, BREAM, HQE...\n- mesure et communication des impacts\n- mutualisation des ressources machines\n- type de refroidissement utilisant des sources d'énergies renouvelables (eau, air...) ou récupération de la chaleur fatale\n- analyse d'impact environnemental du \"move to cloud\" pour les acteurs ayant leur cloud on premise ? calculettes proposées par les fournisseurs en amont de la migration ?\n- comment a été construit le datacenter ? artificialisation des sols\n- etc.\n\nAttention au greenwashing lorsqu'il s'agit de communications sur la neutralité carbone, une charte, une politique ou une feuille de route interne, sans possibilité de vérifier la mise en œuvre ou sans un tiers indépendant qui certifie la mise en œuvre.",
    "controle_en": "Proof of the hosting company's environmental commitments",
    "controle_fr": "Justificatif des engagements environnementaux de l'hébergeur"
  },
  {
    "numero_en": "8.3",
    "numero_fr": "8.3",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service use a hosting service that has a sustainable equipment management policy?",
    "critere_fr": "Le service numérique utilise-t-il un hébergement qui fournit une politique de gestion durable des équipements ?",
    "objectif_en": "Give preference to a hosting company that is committed to the environment, particularly in terms of the way in which it manages equipment: environmental impacts of the purchase of this equipment, purchasing policy (sustainable, repairable purchase), usage policy (upgrade, repair for example) and end-of-use policy (re-use and management of WEEE ' Waste Electrical and Electronic Equipment).",
    "objectif_fr": "Favoriser un hébergement qui a des engagements en faveur de l'environnement notamment sur sa gestion des équipements : impacts environnementaux de l'achat de ces équipements, politique d'achat (achat durable, réparable), politique d'usage (upgrade, réparation par exemple) et politique de fin d'usage (réemploi et gestion des DEEE, les Déchets d’équipements électriques et électroniques).",
    "miseEnOeuvre_en": "Select a hosting company or request commitments from a hosting company with a transparent and ecological equipment management policy.\nFor example, it would be desirable for the hosting company to share details of the total service life of its equipment > 8 years.",
    "miseEnOeuvre_fr": "Sélectionner un hébergeur ou demander des engagements à un hébergeur ayant une politique transparente et écologique de sa gestion des équipements.\nPar exemple, il serait intéressant que l'hébergeur indique une durée de vie totale de ses équipements > 8 ans.",
    "controle_en": "Purchase and management policy of the hosting company's equipment",
    "controle_fr": "Politique d'achat et de gestion des équipements de l'hébergeur"
  },
  {
    "numero_en": "8.4",
    "numero_fr": "8.4",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service use a hosting service that provides environmental impact indicators for its activity?",
    "critere_fr": "Le service numérique utilise-t-il un hébergement qui fournit des indicateurs d'impacts environnementaux liés à son activité ?",
    "objectif_en": "Encourage the use of a hosting company that measures the environmental impacts of using it and makes this information available.",
    "objectif_fr": "Favoriser un hébergement qui mesure et qui rend disponibles les impacts environnementaux liés à son usage.",
    "miseEnOeuvre_en": "Select a hosting company or request commitments from a hosting company which shares environmental metrics, e.g. PUE, WUE, REF standard indicators.",
    "miseEnOeuvre_fr": "Sélectionner un hébergeur ou demander des engagements à un hébergeur proposant des métriques environnementales, par exemple les indicateurs standard PUE, WUE, REF...",
    "controle_en": "Environmental indicators and / or failing that, but not sufficient, energy consumption indicators provided by the hosting company.",
    "controle_fr": "Indicateurs environnementaux et / ou à défaut, mais non suffisant, de consommation énergétique indiqués par l'hébergeur."
  },
  {
    "numero_en": "8.5",
    "numero_fr": "8.5",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service use a hosting service that provides details of its PUE (Power Usage Effectiveness)?",
    "critere_fr": "Le service numérique utilise-t-il un hébergement dont le PUE (Power Usage Effectiveness) est communiqué ?",
    "objectif_en": "Know the PUE of your hosting company. \nReduce or limit energy consumption to what is required for the proper functioning and cooling of servers.",
    "objectif_fr": "Connaitre le PUE de son hébergement.\nRéduire ou limiter la consommation d'énergie nécessaire au bon fonctionnement et au refroidissement des serveurs.",
    "miseEnOeuvre_en": "Select a hosting company that shares information about its PUE and the strategy it implements to reduce it.\nThe PUE is an energy efficiency indicator which is a ratio between the total energy consumed by the whole operation centre (including cooling, air treatment, UPS, etc.) and the part that is actually consumed by the IT systems that this centre uses (servers, storage, network).\nThe closer the PUE is to 1, the better.\nGenerally, a PUE of 1.1 is observed for hyperscalers and 2 for older data centres. A PUE > 2.5 is too high.\nHowever, improving this indicator can negatively impact other indicators, without reducing either the overall impact or energy consumption, hence the utility in monitoring several indicators (energy consumption, water consumption, equipment management policy, etc.).",
    "miseEnOeuvre_fr": "Sélectionner un hébergeur qui indique son PUE et la stratégie mise en oeuvre pour le réduire.\nLe PUE est un indicateur d'efficacité énergétique qui est un ratio entre l'énergie totale consommée par l'ensemble du centre d'exploitation (avec entre autres, le refroidissement, le traitement d'air, les onduleurs...) et la partie qui est effectivement consommée par les systèmes informatiques que ce centre exploite (serveurs, stockage, réseau).\nPlus ce PUE est proche de 1, mieux c'est.\nGénéralement, il est constaté un PUE à 1,1 pour les hyperscalers et de 2 pour les plus vieux centres de données. Un PUE > 2,5 est trop élevé.\nCependant, améliorer cet indicateur peut dégrader d'autres indicateurs, sans que cela réduise ni l’impact global, ni la consommation d’énergie, d'où l'intérêt de suivre plusieurs indicateurs (consommation d'énergie, consommation d'eau, politique de gestion du matériel, etc.).",
    "controle_en": "What is the PUE of the digital service's hosting company?",
    "controle_fr": "Quel est le PUE de l'hébergeur du service numérique ?"
  },
  {
    "numero_en": "8.6",
    "numero_fr": "8.6",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service use a hosting service that provides details of its WUE (Water Usage Effectiveness)?",
    "critere_fr": "Le service numérique utilise-t-il un hébergement dont son WUE (Water Usage Effectiveness) est communiqué ?",
    "objectif_en": "Know the WUE of your hosting company, an indicator that is often not taken into account.\nReduce or limit the consumption of water needed to cool servers.\nAvoid water stress (i.e. a shortage of drinking water). Local water stress can also be taken into account: a high WUE in an area without water stress will be less problematic.",
    "objectif_fr": "Connaitre le WUE de son hébergement, indicateur souvent peu pris en compte.\nRéduire ou limiter la consommation d'eau nécessaire au refroidissement des serveurs.\nÉviter le stress hydrique (c’est-à-dire de pénurie d’eau potable). On peut également prendre en compte notamment le stress hydrique local : un WUE élevé dans une zone sans stress hydrique sera moins problématique.",
    "miseEnOeuvre_en": "Select a hosting company that shares information about its WUE. This indicator is the ratio between the amount of water consumed and the total energy used by the data centre. It is measured in L/kWh.\nNB: currently, there is little or no open data about local water stress.\nAs with the PUE, improving this indicator can negatively impact other indicators, without reducing either the overall impact or energy consumption, hence the utility in monitoring several indicators (energy consumption, water consumption, equipment management policy, etc.).",
    "miseEnOeuvre_fr": "Sélectionner un hébergeur qui indique son WUE. Cet indicateur est un ratio entre la quantité d'eau consommée et l'énergie totale utilisé par le centre de données. Il est mesuré en L/kWh.\nNB : actuellement, il y a peu ou pas de données ouvertes sur le sujet du stress hydrique local.\nComme pour le PUE, améliorer cet indicateur peut dégrader d'autres indicateurs, sans que cela réduise ni l’impact global, ni la consommation d’énergie, d'où l'intérêt de suivre plusieurs indicateurs (consommation d'énergie, consommation d'eau, politique de gestion du matériel, etc.).",
    "controle_en": "What is the WUE of the digital service's hosting company?",
    "controle_fr": "Quel est le WUE de l'hébergeur du service numérique ?"
  },
  {
    "numero_en": "8.7",
    "numero_fr": "8.7",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service use a hosting service where the majority of electricity consumption is from renewable sources?",
    "critere_fr": "Le service numérique utilise-t-il un hébergement dont la consommation d'électricité est majoritairement d'origine renouvelable ?",
    "objectif_en": "Promote the transition to renewable energy.",
    "objectif_fr": "Promouvoir la transition vers des énergies renouvelables.",
    "miseEnOeuvre_en": "Ask the hosting company about its electricity purchasing policy. PPAs (Power Purchasing Agreements) ' long-term renewable energy contracts ' are considered to be of higher quality than electricity certificates of origin. [On this topic, see the report: 'Development of the EU Green Public Procurement (GPP) criteria for data centres, server rooms and cloud services, Renewable Energy Factor, page 99](https://op.europa.eu/en/publication-detail/-/publication/89971797-a9fa-11ea-bb7a-01aa75ed71a1/language-en/format-PDF/source-search). A standardised indicator can be monitored: the [REF, Renewable Energy Factor](https://www.iso.org/obp/ui/#iso:std:iso-iec:30134:-3:ed-1:v1:en).",
    "miseEnOeuvre_fr": "Demander à l'hébergeur sa politique en terme d'achat d'électricité. Les PPA (Power Purchage Agreement), des contrats d’énergie renouvelable de long terme sont considérés de meilleure qualité que les certificats d'origine de l'électricité. [Voir à ce sujet, le rapport Development of the EU Green Public Procurement (GPP) criteria for data centres, server rooms and cloud services, Renewable Energy Factor, page 99](https://op.europa.eu/en/publication-detail/-/publication/89971797-a9fa-11ea-bb7a-01aa75ed71a1/language-en/format-PDF/source-search). Un indicateur normé peut être suivi : le [REF, le Renewable Energy Factor](https://www.iso.org/obp/ui/#iso:std:iso-iec:30134:-3:ed-1:v1:en).",
    "controle_en": "Ask for proof of the source of the electricity consumed by the host (PPA - Power Purchase Agreement as a priority, otherwise certificate of origin of the electricity).",
    "controle_fr": "Demander des justificatifs sur la provenance de l'électricité consommée par l'hébergeur (PPA - Power Purchase Agreement en priorité, sinon Certificat d'origine de l'électricité)."
  },
  {
    "numero_en": "8.8",
    "numero_fr": "8.8",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service use a hosting service that is geographically consistent with the location of its users and activities?",
    "critere_fr": "Le service numérique utilise-t-il un hébergement dont la localisation géographique est en cohérence avec celle de ses utilisateurs et de ses activités ?",
    "objectif_en": "Reduce the distance travelled by the data and therefore reduce the network infrastructure used.",
    "objectif_fr": "Réduire la distance parcourue par les données et donc réduire l'infrastructure réseau mobilisée.",
    "miseEnOeuvre_en": "Select a hosting company whose servers are located close to the users or identified activities. This does not mean adopting Edge Computing technologies, but choosing a data centre close to the users.",
    "miseEnOeuvre_fr": "Sélectionner un hébergeur dont la localisation de ses serveurs est proche des utilisateurs ou des activités identifiées. Cela ne correspond pas à adopter les technologies Edge Computing mais de choisir un centre de données proches des utilisateurs.",
    "controle_en": "Control implementation: identifying the location of users and the location of servers.",
    "controle_fr": "Contrôler la mise en œuvre : l'identification de la localisation des utilisateurs et la localisation des serveurs."
  },
  {
    "numero_en": "8.9",
    "numero_fr": "8.9",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service host \"hot\" and \"cold\" data separately?",
    "critere_fr": "Le service numérique héberge-t-il de façon distincte les données « chaudes » et « froides » ?",
    "objectif_en": "Hot data is data that is used extensively, while cold data is archived data. Using different hosting company (e.g. different databases) would reduce environmental impacts.",
    "objectif_fr": "Les données chaudes sont des données très utilisées alors que les données froides sont des données archivées. Utiliser des hébergements différents (bases de données différentes par exemple) permettrait de réduire les impacts environnementaux.",
    "miseEnOeuvre_en": "Separate hot data from cold data by using technical solutions adapted to the context in which it is used.\nIt is advisable to think about how cold data is stored: there are several technologies on the market, not all of which necessarily have the same impact.",
    "miseEnOeuvre_fr": "Séparer les données chaudes des données froides en utilisant des solutions techniques adaptées au contexte d'utilisation.\nIl convient d'avoir une réflexion sur le mode de stockage des données froides : il existe plusieurs technologies sur le marché, toutes n'ont pas nécessairement le même impact.",
    "controle_en": "Implementation checks",
    "controle_fr": "Vérification de la mise en œuvre"
  },
  {
    "numero_en": "8.10",
    "numero_fr": "8.10",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service duplicate data only when necessary?",
    "critere_fr": "Le service numérique duplique-t-il les données uniquement lorsque cela est nécessaire ?",
    "objectif_en": "Reduce the amount of computing and storage resources used.\nQuestion whether the right level of service has been selected for the actual need. The higher the required availability rate, the more financially and environmentally costly the infrastructure required is.",
    "objectif_fr": "Réduire les ressources informatiques et les ressources de stockage utilisées.\nIl s'agit de se poser la question du bon niveau de service sélectionné par rapport au besoin. Plus le taux de disponibilité demandé est haut, plus cela mobilise une infrastructure coûteuse financièrement et environnementalement.",
    "miseEnOeuvre_en": "Do not systematically duplicate all data. Identify the data that needs to be duplicated (e.g. critical or high demand data). A balance has to be struck between security (to avoid data loss) and dissemination (having too much data everywhere).",
    "miseEnOeuvre_fr": "Ne pas systématiquement dupliquer toutes les données. Identifier les données nécessaires à être dupliquées (données critiques ou données très sollicitées par exemple). Un équilibre est à trouver entre sécurisation (pour éviter les pertes de données) et dissémination (en avoir trop partout).",
    "controle_en": "Reference document, specifications indicating design choices for data redundancy, adjusted as necessary.",
    "controle_fr": "Document de référence, spécifications indiquant les choix de conception quant à la redondance des données, ajustés selon les besoins."
  },
  {
    "numero_en": "8.11",
    "numero_fr": "8.11",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service use redundancy only when necessary?",
    "critere_fr": "Le service numérique utilise-t-il une redondance uniquement lorsque cela est nécessaire ?",
    "objectif_en": "Reduce the amount of computing and storage resources used.\nQuestion whether the right level of service has been selected for the actual need. The higher the required availability rate, the more financially and environmentally costly the infrastructure required is.",
    "objectif_fr": "Réduire les ressources informatiques et les ressources de stockage utilisées.\nIl s'agit de se poser la question du bon niveau de service sélectionné par rapport au besoin. Plus le taux de disponibilité demandé est haut, plus cela mobilise une infrastructure coûteuse financièrement et environnementalement.",
    "miseEnOeuvre_en": "Question the utility of service redundancy. Is it critical if the digital service is not available for a certain period of time?\n* Backup & Restore is the least expensive, perfectly adapted to applications which have an RTO (Recovery Time Objective) or RPO (Recovery Point Objective) of a few hours.\n* The Pilot Light, for example, is a \n'mirrored\n' / duplicated database but with VMs turned off, a little more expensive than Backup & Restore and works for most applications that do not have extreme SLA requirements (less than 1 hour).\n* Warm Standby is when VMs are already running but with limited scalability, almost in real time but potentially with slightly degraded quality if an incident occurs.\n* Multi-Site Hot Standby: total resilience for real time SLAs. No loss of service is tolerated, but of course this comes at a cost.",
    "miseEnOeuvre_fr": "Se questionner sur la pertinence de la redondance du service. Est-ce critique si le service numérique n'est pas disponible pendant un certain temps ?\n* Le Backup & Restore est ce qu’il y a de moins cher, parfaitement adapté aux applications qui ont un RTO (Recovery Time Objective) ou RPO (Recovery Point Objective) de quelques heures.\n* Le Pilot Light, c’est par exemple une base de données \"mirrorée\" / dupliquée mais avec des VMs éteintes, procédé un peu plus cher qu’un Backup & Restore cela fonctionne pour la plupart des applications qui n’ont pas des exigences SLA extrêmes (inférieures à 1 heure).\n* Le Warm Standby, c’est lorsque les VMs tournent déjà mais dans une scalabilité limitée, quasiment en temps réel mais potentiellement en qualité légèrement dégradée si incident.\n* Le Hot Standby Multi-Site : total résilience pour des SLAs temps réel. Aucune perte de service n’est tolérée, mais forcément cela a un coût.",
    "controle_en": "Verification of the presence of an SLA (Service Level Agreement) adjusted according to needs, for example",
    "controle_fr": "Vérification de la présence d'un SLA (Service Level Agreement) ajusté selon les besoins par exemple"
  },
  {
    "numero_en": "8.12",
    "numero_fr": "8.12",
    "thematique_en": "Hosting",
    "thematique_fr": "Hébergement",
    "critere_en": "Does the digital service use a hosting service that recovers waste heat from the servers?",
    "critere_fr": "Le service numérique utilise-t-il un hébergement qui récupère la chaleur fatale produite par les serveurs ?",
    "objectif_en": "Encourage initiatives to recover the energy produced ' to heat buildings in winter, for example. [Definition of waste heat according to the ADEME] (https://grand-est.ademe.fr/expertises/produire-autrement/chaleur-fatale/chaleur-fatale-de-quoi-parle-t)",
    "objectif_fr": "Encourager les initiatives permettant de récupérer l'énergie produite, par exemple pour chauffer des batiments en hiver. [Définition de la chaleur fatale selon l'ADEME](https://grand-est.ademe.fr/expertises/produire-autrement/chaleur-fatale/chaleur-fatale-de-quoi-parle-t)",
    "miseEnOeuvre_en": "Select a hosting service or request commitments from a hosting company to reuse the waste heat generated, for example, to directly heat offices or other facilities nearby.",
    "miseEnOeuvre_fr": "Sélectionner un hébergeur ou demander des engagements à un hébergeur de réutiliser la chaleur fatale générée, par exemple, pour chauffer directement les bureaux ou d'autres installations à proximité.",
    "controle_en": "Documentation of the hosting company's initiatives for the recovery and reuse of waste heat. If not applicable, justify why. The overall environmental report on reusing the heat produced does not need to be positive, taking into account the initial investment on building or adapting the facilities.",
    "controle_fr": "Documentation des initiatives mises en place par l'hébergeur pour la récupération et la réutilisation de la chaleur fatale. Si non applicable, le justifier. Il est nécessaire que le bilan environnemental global de la réutilisation de la chaleur produite soit positif, en tenant compte de l'investissement initial pour la construction ou l'adaptation des installations."
  }
]
